[
  {
    "name": "miawalks",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "soo good for a glossy eye look! super affordable and long lasting❤️",
    "time": "2022-05-21T18:36:52.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "Katalimar",
    "rating": 5,
    "recemonded": true,
    "title": "If you are considering trying this, just buy it!",
    "text": "I cannot express how amazing this product is. I've used this predominantly as an eye pigment. it doesnt transfer or crease all day. You use very little product for great colour payoff and coverage. This is the perfect colour for an everyday look. And moreover, you get a lot of product for the price.",
    "time": "2022-05-18T05:30:21.000+00:00",
    "age": "over54",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Tylerthecreativ",
    "rating": 2,
    "recemonded": false,
    "title": "Disappointed",
    "text": "Was looking for something easy to apply on the go but the formula is sticky and temperamental. Unfortunately it transfers and is patchy.",
    "time": "2022-05-15T05:34:55.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "nano221",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "I put highlighter on my eyes for a look and used this as a primer because its tacky. Gave me a beautiful shine. Tried to use it as a lip gloss but it absorbed super fast.",
    "time": "2022-05-15T00:46:30.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "inspiritviki",
    "rating": 1,
    "recemonded": false,
    "title": "Beautiful formula, terrible packaging...",
    "text": "I just wrote a 5-stars review last week for this product and one week later, the product has dried out at the tip applicator, so no product can come out. I tried to squeeze the product out and the whole tube exploded on me, leaving glitters ALL OVER MY ROOM. This is just not worth it, no matter how pretty the formula is. The formula is pretty much waterproof, so it was so difficult cleaning up the mess from the explosion. Until Danessa updates the packaging, I don't think I will pick up this product. Unfortunately, I had to return the exploded tube and I love the color :(",
    "time": "2022-05-08T21:52:55.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "rdel123",
    "rating": 3,
    "recemonded": false,
    "title": null,
    "text": "Long lasting and doesn't budge once dried down.\n\n3 stars because the glitter particles are bigger than I wanted. The color is very silver, very pigmented with big glitter particles.\n\nThe matte ones are great and pigmented, so I prefer the matte. I don't recommend the glitter ones if you were wanting smaller glitter particles. \n\nThis would be great for looks where you wanted to make a glitter-packed look where this is the main actor. \n\nNot great for highlighting nor lightly using this to top up your eyes, at least for me, where smaller glitter would work better.",
    "time": "2022-05-07T17:10:39.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "janski",
    "rating": 4,
    "recemonded": true,
    "title": "Beautiful product.",
    "text": "This is a beautiful product and I love the way that it goes on, however the glitter in it fell into my eyes. I would definitely order one of the matte ones and I would definitely order one of the shines. I am having to return the glitter or metallic. If you use it on your cheeks it would be fine but if you can’t wear glitter near your eyes then I would not recommend it for eyeshadow.",
    "time": "2022-05-04T20:17:36.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Stephanieh1980",
    "rating": 5,
    "recemonded": true,
    "title": "Sweet!!",
    "text": "These are amazing! The foils are a little harder to work with than the matte formula, but beautiful nonetheless:) Great quality, super pigmented! A little more tacky feeling than the mattes. Im also wearing plum wine shade in my crease",
    "time": "2022-05-04T18:28:40.000+00:00",
    "age": "over54",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "KatieandJenny",
    "rating": 1,
    "recemonded": false,
    "title": "HATED THIS",
    "text": "I don’t know what I was expecting but it was NOT this. Very sticky, felt like my eyelids were stuck open. Patchy application, I couldn’t get it to lay on evenly, there was literally patches where product wouldn’t stick down. It’s full on glitter so WAY too much for every day wear. And then when I was removing it, the glitter scrapes against your skin and is actually uncomfortable. I never write reviews. But this needed a review.",
    "time": "2022-05-04T14:32:31.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "RedPandaONE",
    "rating": 3,
    "recemonded": false,
    "title": null,
    "text": "This was intended for eyeliner as I wanted something budge-proof and with enough product where it would not dry out in 2 weeks.  I did get a lot of product! *But* this does not work well for lining your eyes as it will smudge, transfer and fade.  The colour ( in 'Blackout') isn't deep enough black for me but I can make it work by using it very sparingly and by drawing thin lines.  Don't even think of trying it in your waterlines.  If you want something for an easy smoky eye, then this is great for that.",
    "time": "2022-05-03T23:35:22.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Stephanieh1980",
    "rating": 5,
    "recemonded": true,
    "title": "Crazy Good!!",
    "text": "OMG! This stuff is amazing! I have only used this matte formula so far (I bought 3 shades) Crazy pigmented and amazing color payoff!! I only needed the tiniest bit (smaller than a grain of rice to do both eyes) It was a bit tricky at first, but I managed just fine. Doesn't feel heavy or sticky. No creasing or movement. Need an oil based remover to get it off because this doesn't budge. I immediately purchased 2 more! Fantastic!!",
    "time": "2022-05-03T18:10:42.000+00:00",
    "age": "over54",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "charbeen",
    "rating": 5,
    "recemonded": true,
    "title": "Oooh pretty",
    "text": "Whoa so pigmented!! A little goes a long way.  Used it as a topper and enjoyed it .  Will have to use it a few more times but quite enjoy the effect . This will probably last me forever as I used only a dot of product to do both eyes",
    "time": "2022-05-01T17:57:15.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "MarinaOweis",
    "rating": 1,
    "recemonded": false,
    "title": null,
    "text": "Wasn’t sparkly enough after it dried down it looked very dull \nI had to return unfortunately \nNot worth the hype at least this shade",
    "time": "2022-04-30T15:00:32.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "Emxgosselin",
    "rating": 5,
    "recemonded": true,
    "title": "Love it!",
    "text": "I love this gloss! I’ve been wanting a lid gloss for a while and this one is great. Something about a glossy lid is just *chefs kiss* beautiful. Only thing I would say is make sure this is the last step on your eye make up. Even after lashes. I went to put on lashes after applying and could not for the life of me get them to stick. Makes sense now that I think about it but yeah. Last step in your eye make up and you will look stunninggg",
    "time": "2022-04-27T21:35:57.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "inspiritviki",
    "rating": 5,
    "recemonded": true,
    "title": "Jewelz!",
    "text": "Jewelz is so glittery and pretty! Very fine glitter, not chuncky glitters. So far I've used it twice and the lasting power on my lids (and hand, when swatched) is amazing, truly waterproof. Very special shade and I'd totally recommend this. \n\nI've read reviews that this dries out quickly so I hope that's not the case.",
    "time": "2022-04-27T17:01:43.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "inspiritviki",
    "rating": 4,
    "recemonded": false,
    "title": "Celebration",
    "text": "I was watching an influencer who recommended the Danessa Myricks Colorfix Pigment in Celebration so I bought it on a whim. Celebration is a very pretty chestnut brown but it is supposed to be metallic, but I fail to see any metallic at all. There are tiny flecks of shimmery fine glitters within the formula, it is not completely matte, however, i won't call it metallic. I have powder shadows that are more metallic than this. I'm not sure if this shade justify the $18 price tag since I find it to be pretty ordinary. However, I swatched this on my hand and then tried to wash my hand a few minutes later and the formula would not budge, which is means this is quite long-wearing. In any case, I don't really recommend the shade Celebration. You probably own a better metallic brown shade in your collection already.",
    "time": "2022-04-27T16:41:51.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "lharvz",
    "rating": 5,
    "recemonded": true,
    "title": "long lasting + great texture",
    "text": "This product is remarkable!! It really stays in place and the glitter doesn’t have any chunky texture to it. Even works on lips (I mean idk why you would want glitter lips but if you need them this works)",
    "time": "2022-04-25T00:29:02.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "Andyxoxo",
    "rating": 3,
    "recemonded": false,
    "title": "Beautiful product bad packaging",
    "text": "The product is 5 stars but the packaging is a huge fail. After a couple times using it, I went to apply from the tube to my finger tip, barely applied any pressure to the tube and the product exploded out. Wasted most of the product. Wish it had a tiny doe foot applicator inside to get to the product instead of a squeeze tube. Probably won’t repurchase unless packaging is changed. There are so many glitters on the market with better packaging.",
    "time": "2022-04-25T00:28:10.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "Rsy7",
    "rating": 1,
    "recemonded": false,
    "title": null,
    "text": "If you are trying to use this as an eyeliner do not bother. It's not high in pigment for an eyeliner and is just very messy and goes everywhere. I do not recommend whatsoever for eyeliner.",
    "time": "2022-04-24T22:47:07.000+00:00",
    "age": "over54",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Denetnet1",
    "rating": 4,
    "recemonded": true,
    "title": null,
    "text": "Easy to work with, great pigment! My only concern is the shelf life of the product. My purple one is drying out and I purchased 3-4 months ago!",
    "time": "2022-04-21T04:25:13.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "marissammm",
    "rating": 5,
    "recemonded": true,
    "title": "I’m so glad I bought this",
    "text": "This is seriously so amazing. I use it over my caviar sticks when I want a more glittery look on my eyes and it really delivers! The color is gorgeous duochrome and it stays all day long until I take it off. The fact that this can be used on lips and cheeks as well just blows my mind, this color makes a great highlighter in a pink and I also put it on my lips for lipstick recently and it looked shimmery and amazing! Then I tried it under a pink balm and the effect was a subtle glow. Honestly I just wish Sephora carried their whole line of colors so I could try the neon for the summer and get the rest of the foil colors.",
    "time": "2022-04-21T02:16:36.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "foren6",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "I tried this after watching a few reviews on YouTube. This is the perfect one swipe shadow and go! Gives the perfect amount of color and blends beautifully. I’ve only worn it on my eyes so far but I’m in love! I already ordered another one in the color Alien. Can’t wait for it to arrive!",
    "time": "2022-04-20T21:07:35.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "losan8",
    "rating": 1,
    "recemonded": false,
    "title": null,
    "text": "oh boy where do i begin. i really wanted to love it. it’s super dry, matte and it doesn’t blend good at all. def don’t recommend.",
    "time": "2022-04-18T00:45:08.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "AliLebegue86",
    "rating": 3,
    "recemonded": false,
    "title": "Beautiful color, but it dries really fast",
    "text": "Really beautiful color, and stays put. But it dries really really fast so you have to be quick. I'm going to keep it, but probably won't buy it another color",
    "time": "2022-04-14T19:07:56.000+00:00",
    "age": "over54",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "lizbg",
    "rating": 3,
    "recemonded": true,
    "title": "it’s an okay product",
    "text": "I thought this product was going to look more like a gel type on the lid. It’s a regular metallic/glittery shadow. It doesn’t have any fallout. But not what I’m looking for. It dries down quickly so work it quickly onto the skin. If I didn’t have so many other similar products I would have kept it and given it a four. But because I thought it was more cream/bell like it’s a three for me. It says it’s a cream pigment which I understand it looks it when you squeeze the bottle on have it on the finger but once it glides on the skin (eyelid for me) it dries down like a dry powder. I would recommend it if you don’t have a big collection of this color.",
    "time": "2022-04-13T21:01:57.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "alyciamedina",
    "rating": 5,
    "recemonded": true,
    "title": "THE. BEST!!!",
    "text": "This product is so so so underrated, like it deserves ALL the hype. SO stunning, so easy to use and it lasts ALL FREAKIN DAY!!! What more could I ask for?! I need them all!! This is an insanely beautiful product, just try it you won’t regret it",
    "time": "2022-04-13T04:19:07.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "Meggg06",
    "rating": 4,
    "recemonded": true,
    "title": null,
    "text": "Great colour and great consistency. Doesn’t crease and lasts pretty long on me. One thing is that it gets hard to squeeze out something. Maybe it is because the opening is clogged somehow.",
    "time": "2022-04-11T00:41:37.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "misslovesdogs",
    "rating": 5,
    "recemonded": true,
    "title": "loveee",
    "text": "obsessed. love how it comes out and will buy more!!!",
    "time": "2022-04-10T02:03:40.000+00:00",
    "age": "over54",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "emma1689",
    "rating": 5,
    "recemonded": true,
    "title": "GORGEOUS",
    "text": "LOVE this product, i am buying more shades! Looks so pretty",
    "time": "2022-04-08T15:49:26.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "AnnePaige",
    "rating": 2,
    "recemonded": false,
    "title": null,
    "text": "I love the color! It was so pretty! However, no matter what I did, it never felt fully dry. My eyelids constantly kept sticking. I used a primer and setting spray but I would have to use another eyeshadow or something to make it stop sticking which covered the color. So this was a waste of money for me. But I do want to add that I have very hooded eyelids and that could have been a factor. But for me, this is a no.",
    "time": "2022-04-06T16:31:36.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "1254Jessica",
    "rating": 3,
    "recemonded": true,
    "title": "Glitter explosion",
    "text": "Great product, the tube clogged though in the first week! When i squeezed the tube the liquid glitter E X P L O D E D all over my bathroom, everything everything covered in glitter and all my product gone.. I know how to use a tube lol, this seems like a flaw to me.",
    "time": "2022-04-04T14:42:04.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "michb",
    "rating": 5,
    "recemonded": true,
    "title": "transfer proof magic",
    "text": "Does. Not. Budge. This one is glittery and blends nicely with my medium skin tone. No glitter fall out. I have numerous shades, but only use them on my eyes. They would be too drying for my lips, so check out the shiny/glaze ones for lips.",
    "time": "2022-04-04T02:10:45.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "MAKEUPFOREVERFL",
    "rating": 5,
    "recemonded": true,
    "title": "a must-have",
    "text": "smooth blend- beautiful color.  I've applied with both fingers and brush. a little goes a very long way.",
    "time": "2022-04-04T01:13:19.000+00:00",
    "age": "over54",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "buttplug",
    "rating": 4,
    "recemonded": true,
    "title": "smooth! long lasting! darker than picture!",
    "text": "The product is incredibly smooth wearing, stays on like a tattoo, doesn't seem to crease unless really piling on 10 or more layers (which isn't necessary). \n\nThe colour is extremely pigmented but darker than i was hoping, based on the picture.\n\nProduct can stand alone or can be used under or for blending (must blend before sets!!)\n\nWas hoping for a closer to beige look for buildable and combination looks with other shadows, but I'll see what I can do.",
    "time": "2022-03-31T03:33:34.000+00:00",
    "age": "over54",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "briaaaana",
    "rating": 5,
    "recemonded": true,
    "title": "best cream shadow out there!",
    "text": "I can’t say how much I love this product. I started with one color and have been buying them all. They are so creamy and blendable but then set and are waterproof. Use with your finger or a synthetic brush. Great for layering underneath other eyeshadow or to use as eyeliner, or even an under eye smudge instead of using eye shadow.",
    "time": "2022-03-28T08:04:47.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "aburke5",
    "rating": 5,
    "recemonded": true,
    "title": "do not sleep on this!",
    "text": "I love this product so much! It’s such a unique, multi-purpose product. The mica in this shade is so beautiful and can create multiple looks. You can use a lighter hand to achieve a shimmery look or you can use more and get a more metallic sheen. \n\nA tiny bit goes such a long way. I use the tiniest dot and can cover my whole eyelid. \n\nI love DM beauty. Such a fan.",
    "time": "2022-03-27T15:22:56.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "LeadLinda",
    "rating": 5,
    "recemonded": true,
    "title": "Fantastic Long Stay Lip Color",
    "text": "I looked for year to find that perfect color and this is it.  Also, this product does last all day.  The only negative is that you need to find a good lip brush to apply the color.",
    "time": "2022-03-27T00:12:49.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "discowitch",
    "rating": 5,
    "recemonded": true,
    "title": "Astounding!",
    "text": "After watching Danessa work with this pigment on a model, I knew I had to buy it. The tiniest amount just goes...and goes...and goes. The blending time is just long enough, and I can use my fingers or brushes, depending on the precision level I want.",
    "time": "2022-03-22T19:43:27.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "whailey",
    "rating": 5,
    "recemonded": true,
    "title": "10/10 - Amazing Product!!",
    "text": "This is my first time trying this product and I absolutely love it. It is transfer-proof and the color is very vibrant. I used it as a lipstick, eyeliner, and an eyeshadow. I have combination skin, and I have to say I’m pleased with the wearability of this product. Upon applying it, it feels like a cream, but once it dries, it becomes weightless and matte. I really loved this product because I could barely tell I was wearing anything on my face. Usually, I have a hard time finding products that are genuinely transfer-proof, smudge-proof, and weightless. I am so happy I stumbled upon this product. I also have to say that it’s pretty easy to take off as well depending on what products you use. I used the Garnier waterproof micellar water and with a few swipes there was very little smudging, and the product came right off.",
    "time": "2022-03-19T03:58:38.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "SaraSingh",
    "rating": 5,
    "recemonded": true,
    "title": "Excellent Pigment - a little goes a long way",
    "text": "This stuff is highly pigmented. I bought it to use as a blush and while it works well, it is difficult to get the amount you need and not too much. It has good staying power and blends well, and I love the colour. I’m sure I will be using it a long time.",
    "time": "2022-03-14T19:43:20.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "Nanners0",
    "rating": 5,
    "recemonded": true,
    "title": "Very pigmented",
    "text": "This is the most pigmented cream color I’ve ever used. A little dab goes a long long way. Blend fast though since the matte formula dries relatively quickly. Long lasting formula and if you use it right, it’s totally worth the hype.",
    "time": "2022-03-13T14:08:55.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "JacklynJetSet",
    "rating": 5,
    "recemonded": true,
    "title": "Multi purpose white shadow blows my mind",
    "text": "This product, Colorfix, is the ideal dream product of all creative makeup artists.\nBuild able coverage, incredibly well pigmented,  dries quickly and doesn't budge, becomes waterproof.\nCan be extended with the Danessa Myricks Beauty Beauty Oil\nI have tons of colors, incredible product.",
    "time": "2022-03-08T22:29:32.000+00:00",
    "age": "over54",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "georgiaapeaach",
    "rating": 3,
    "recemonded": false,
    "title": null,
    "text": "I really wanted to love this as an eyeliner. I saw the shade in store, and Chocolate is this beautiful berry toned brown that has a ton of red and purple pigment. I was so excited to try. But this is truly such a mess to use as an eyeliner. I had to squeeze a drop onto a palette, and coat an eyeliner brush. My issue is that it starts to dry quite quickly. So after I applied the initial wing and dipped in to apply more, it started to get patchy because it was drying at different paces. After 5 days of trying to use it as a liner, I gave up. I tried wearing it as an eyeshadow, but this thing is so incredibly opaque that it really doesn't blend out. I just found this formula was too hard to work with an not worth the hassle. Lastly, you NEED to use an oil to remove this stuff. None of my face washes could get it off.",
    "time": "2022-03-05T02:45:33.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "TaylorRy",
    "rating": 5,
    "recemonded": true,
    "title": "sooo good",
    "text": "I got primary red to use as an eyeliner. This formula is A++++ it does NOT smudge or transfer and it will not stain the skin. It took so little to achieve full pigment. These are an amazing way to get creative as it’s such a multi use product. I’m pretty sure i’ll own all the colors by the end of the year.",
    "time": "2022-03-04T20:47:01.000+00:00",
    "age": null,
    "sephora_staff": "true",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "lydia222222",
    "rating": 5,
    "recemonded": true,
    "title": "nice blending",
    "text": "nice pigment and blends out well. I have only used it by itself and like it a lot",
    "time": "2022-03-01T04:09:00.000+00:00",
    "age": "over54",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "lydia222222",
    "rating": 1,
    "recemonded": false,
    "title": "no good",
    "text": "too watery and doesn't dry down well. doesnt blend obviously, kinda unusable tbh. flakes easily. cool color, too bad it doesnt stay on the lid",
    "time": "2022-03-01T04:07:39.000+00:00",
    "age": "over54",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "sspeltz",
    "rating": 5,
    "recemonded": true,
    "title": "Life changing",
    "text": "Every time I buy a new makeup product, I've convinced myself it's going to be the one that changes my life. This time I was right! I'm so glad the advisor recommended it to me. As a heavy duty makeup artist and performer with oily skin, it's very hard for me to get a long lasting, clean cut crease. This lasts all night and doesn't budge. I've tried all kinds of primers and concealers to get eyeshadow to stick and this is head and shoulders above the rest. To me, it beats the following concealers and eyeshadow primers as a base: Lancome Teint Idole concealer, P. Louise, Urban Decay, Too Faced BTW, Tarte Shape Tape, Clinique (all primers and concealers) , Morphe, Estee Lauder Doublewear Concealer, Nars primer, Bobbi Brown (all), Elizabeth Mott, and Revolution (concealer). A must have for any makeup pro. I'm currently using the white for a dramatic look but plan to purchase a flesh tone in the future. I cannot recommend it enough. Worth every penny. A little goes a long way, and it's super easy to use. My new favorite thing.",
    "time": "2022-02-27T01:55:54.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Cytto",
    "rating": 5,
    "recemonded": true,
    "title": "The duochrome foil of my dreams",
    "text": "I put this on my lids over the shade Rustic and it turned out beautiful. You can either blend it on your eyelid to pull out the glitter aspect of it, or apply it straight onto your lid and pat it down to bring out the foiled effect. After applying I recommend holding your eyes closed for 30 seconds or less for it to dry down, but once it dries it doesn't budge or feel heavy.",
    "time": "2022-02-26T06:16:11.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Cytto",
    "rating": 5,
    "recemonded": true,
    "title": "Versatile product that is worth the $$",
    "text": "Amazingly pigmented but can be blended out beautifully. I used this as a shadow and used it with an eyeliner brush to make a bold wing. Went on great as an blush AND lipstick!",
    "time": "2022-02-26T06:12:38.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "lowborn",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "Super beautiful nude shimmer, almost gives a wet effect when the light hits it. The formula is super thin and comfortable and lasts all day, even when my lids get oily. I’m using Milky Way here and chocolate as liner.",
    "time": "2022-02-23T01:20:47.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Mpll",
    "rating": 4,
    "recemonded": true,
    "title": "Review For Shade Venus",
    "text": "This shade is a very pretty colour with quite a bit of glitter. It’s translucent so there isn’t that much of a base pigment other than a pretty pink colour. When layered with the Urban Decay eye primer it stays put for about 9 hours. By itself it lasted 5 hours before it creased on me but I do have oily lids that are prone to creasing.",
    "time": "2022-02-21T20:05:06.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "lowborn",
    "rating": 5,
    "recemonded": true,
    "title": "truly underrated",
    "text": "I had originally bought the primary red because I’m always on the hunt for great red eye products and after trying it, I was hooked and had to get the black and the white is on my wishlist. They’re a really thin, easy to work with consistency but EXTREMELY pigmented and dry down comfortably matte. The black has got to be the best eyeliner I’ve ever used, my only complaint is that I don’t like squeeze packaging but I understand that it’s a personal preference.",
    "time": "2022-02-19T04:19:48.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "legallyblondie",
    "rating": 1,
    "recemonded": false,
    "title": "Patchy mess",
    "text": "I’ve seen so many rave reviews but this was a total fail for me. I am on the hunt to replace my beloved MAC paint pot in Quite Natural and this is not it. On my fair skin, this shows up as pure purple. No brown in sight. I applied two layers and it was very patchy and didn’t blend well, so I tapped on a matte brown shadow. It looked great at first. By the end of the work day, it was a purple patchy nightmare. This product did not apply well, blend well, or wear well. Thank you Sephora for your excellent return policy! I wish this had worked and I’m still curious about the shimmer shades, but I cannot recommend this shade/formula",
    "time": "2022-02-18T07:12:16.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "coribelle",
    "rating": 5,
    "recemonded": true,
    "title": "Perfect Pinky Nude",
    "text": "Perfect pigmentation for lips and cheeks. I am in love with his product and have bought additional Colorfix colors, happily.  Danessa Myricks is the Queen!",
    "time": "2022-02-16T18:31:29.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "darleneg",
    "rating": 4,
    "recemonded": true,
    "title": "Lovely colors at a great price!",
    "text": "I'm 57 years old, retired, active, and still love wearing  and trying out new products. I ordered the Rose Dream Trio to begin with and loved, loved, ballerina. The other two don't work well for my eyes so I use them on my lips. I then ordered Milky Way and it was waaaaay too sparkly for me. I also ordered Romance and love the color, but the formula is so runny, I've made several messes, including a big splotch on my shoes. I still use it, but have to remember to be verrrry careful. All in all, these are beautiful, long lasting products at a great price and my go to along with Thrive Causemetics eye shimmer pencils.",
    "time": "2022-02-12T17:13:57.000+00:00",
    "age": "45to54",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "twocatmom",
    "rating": 5,
    "recemonded": true,
    "title": "Lovely Gel Face Color",
    "text": "Lovely, long wearing, gel formula. This hot pink matte shade is very saturated, so use sparingly on fairer skin tones.",
    "time": "2022-02-10T21:48:54.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "GeorgiePeach",
    "rating": 5,
    "recemonded": true,
    "title": "amazing",
    "text": "This is so pigmented so a little goes a long way. The color is so pretty. It does dry a bit quick. Definitely buying more colors",
    "time": "2022-02-05T16:26:44.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "pvnia",
    "rating": 4,
    "recemonded": false,
    "title": null,
    "text": "kinda leaves a patchy trace. not that easy to use.",
    "time": "2022-02-03T23:39:04.000+00:00",
    "age": "over54",
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "SatoriLuna",
    "rating": 5,
    "recemonded": true,
    "title": "this is such a versatile product!",
    "text": "As a makeup artist this is amazing! I can create a Smokey eye so easily. Just squeeze a little out onto my palette and grab a dense brush and place on lid. I then grab a blending brush and blend up to crease. I add a little brown on the crease and then I let pigment set and it doesn’t leave fall out. I then go do either my brows or start color correcting and if I want it to be really longwear I tap a little black\nShadow on the lid. Then blend and you have a super pigmented quick smokey eye. I haven’t tried it on my lips yet but that’s my next thing to try. I have used it as liner and it dries down matte. A great product for every goth, glam, and makeup artist.",
    "time": "2022-01-29T14:26:44.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "HollydayS2",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "Highly pigmented, glides smooth and easy on skin, super durable! Just amazing!",
    "time": "2022-01-26T18:07:34.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "jumpcutjen",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "Love it. Use Crème Brûlée all the time. Mostly on eyelids, sometimes lips too… goes on smooth.",
    "time": "2022-01-24T04:16:58.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Shojax",
    "rating": 5,
    "recemonded": true,
    "title": "Small product goes a long way",
    "text": "One dot on each cheek is all you need for instant color- even on brown skin! Surprisingly lasts all day, this small tube will last a long time! Stays put on eyelids as well. Will try on lips soon. Worth it!",
    "time": "2022-01-24T03:47:10.000+00:00",
    "age": "over54",
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "jenniered",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "Love this 3 in 1 \nI mostly use it on my lips , lasts almost all day. Adds alittle shine . Cannot wait to get a few other shades .",
    "time": "2022-01-23T13:16:40.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "PatriciaLo",
    "rating": 5,
    "recemonded": true,
    "title": "Wow wow WOW",
    "text": "okay so i'm going through this phase where i like for the colors on my lips to simply complement what i already have going on. and this shade is amazing. totally brown girl friendly. i am a medium-deep complexion and this color is everything on the lips. i know it can be worn numerous ways. but if you are a brown girl please give the shade cupcake a try as a lip color. you will not regret it!",
    "time": "2022-01-23T02:11:06.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "greneyes",
    "rating": 2,
    "recemonded": false,
    "title": "Yuck",
    "text": "Color disaster.  Very dark brown Pink! Why pink or dark pink.  Not the color shown on line.  If color was right I would like product. Seems to have staying power, but my gosh horrible color unless this was a mistake & labeled wrong. Sending back.  My forst order with them.",
    "time": "2022-01-22T05:02:54.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Dai2",
    "rating": 5,
    "recemonded": true,
    "title": "Yessss!!!",
    "text": "Colofix in Carrot Top gives what it’s supposed to GIVE!  Great waterproof pigment that melts on your skin and blends with ease.  A little goes a long way.  I’m wearing it on my eyes, cheeks and lips.",
    "time": "2022-01-21T06:05:43.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "mintjulep7",
    "rating": 5,
    "recemonded": true,
    "title": "gimmie all the real reds!",
    "text": "I have been looking for a real red I could put on my eyes and this is it. A little goes a long way and it is you can build up ~ stays put ~ goes on creamy and dries within a reasonable amount of time. I paired it with a matte red ~ go easy putting on a waterline ~ it spidered into my eyeball at first but that is my learning curve. I had too much on my brush.",
    "time": "2022-01-16T04:56:44.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "JKSEA",
    "rating": 3,
    "recemonded": false,
    "title": "Disappointed",
    "text": "I had such high hopes for this product I bought it and didn’t use it immediately I opened it about a month later and it was so sticky and such a strange consistency I couldn’t wear it on my eyes, my eyelids skin stuck to itself even after letting it dry for over 10 minutes…. I reached out to someone who uses these products all the time she confirmed this was not a normal texture of the product and was surprised at the way it was reacting when it was applied. I reached out to the company just basically saying hey .. can this be replaced I clearly have a bad tube and they said no you’re not using it right it’s not the product it is user error…i have since tried a few other colors from this line and they were fine .. It is just too bad the company wanted nothing to do with hearing about this bad tube of product…very disappointing. though the other products that I did try they were also colorfix… I really liked then, the product worked as expected. I just can’t give this a good review, when that was first experience with this brand and their customer service.  I didn’t want anything for free just a replacement as I had tossed the packaging upon opening and it had been over a month since purchasing I went to DM directly and not Sephora, maybe that was a misstep but still disappointed.",
    "time": "2022-01-16T00:39:46.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "ThebeautyLover1",
    "rating": 5,
    "recemonded": true,
    "title": "BUY CARROT TOP IF YOU HAVE BROWN TAN SKIN",
    "text": "Loveeee the orange on my medium-medium deep skin tone!!",
    "time": "2022-01-14T19:21:52.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Corsick",
    "rating": 1,
    "recemonded": false,
    "title": null,
    "text": "I put this on my eyes & it was super dark & blotchy. I didn't like the color, either. I returned it.",
    "time": "2022-01-07T04:48:48.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "TinaNYCC",
    "rating": 4,
    "recemonded": true,
    "title": "lipgloss on eye by its self",
    "text": "Pros: its lasting, its a beautiful color, and pigmented\nCons: this is not to be meant to be used alone, if you put it on your eyelids its almost like lipgloss. Its so sticky doesnt dry down by its self. Also its patchy used alone.\n\nI recommend you using a base color and then apply this to your eyes, like an eyeshadow topper and somehow like this it does dry down.\n\nI provided photos. 1) with base on my eye 2) on my hand without a base",
    "time": "2022-01-05T14:29:09.000+00:00",
    "age": null,
    "sephora_staff": "true",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "onlylinz",
    "rating": 5,
    "recemonded": true,
    "title": "Have a gameplan and it's great!",
    "text": "A little goes a long way with these to get the color payoff. Formula does dry within a minute or two, so as long as you know what look you're going for and how to work fast, pretty set. Would also recommend using a palette or surface when handling more than a drop just so you don't get it everywhere or have it dried down where you don't need it.",
    "time": "2022-01-04T04:34:55.000+00:00",
    "age": "over54",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "kitchensink",
    "rating": 5,
    "recemonded": true,
    "title": "An amazing product",
    "text": "This duochrome liquid shadow is to die for. It's layerable and delivers amazing colour.",
    "time": "2022-01-03T20:56:42.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "oXMakeupKateXo",
    "rating": 5,
    "recemonded": true,
    "title": "Everyone needs this colour!",
    "text": "I love colorfix, they are a staple in my kit but this colour is my all time favorite, it looks great on everyone. Such a quick, long lasting product. It won't take be long before I need a new one!",
    "time": "2021-12-31T05:29:06.000+00:00",
    "age": "over54",
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "KymberLayne",
    "rating": 5,
    "recemonded": true,
    "title": "Gorgeous twinkle",
    "text": "This is everything I hoped it would be and more! I got this shade specifically after seeing my favorite youtuber rave about it. It's the most sparkly, gorgeous cream shadow, that lasts all day without creasing. I think it's perfect for the holiday season.",
    "time": "2021-12-26T01:53:02.000+00:00",
    "age": "over54",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Msgdfx1",
    "rating": 5,
    "recemonded": true,
    "title": "Fantastic, intense color.",
    "text": "Fantastic. Very intense color. A little goes a long way. So happy I discovered this product.",
    "time": "2021-12-24T07:05:19.000+00:00",
    "age": "45to54",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Trapcat",
    "rating": 5,
    "recemonded": false,
    "title": null,
    "text": "I never thought I would be putting gloss on my eyes but now I can't stop. Dotting this color on gives me the perfect pinky brick eye color and the gloss looks amazing. Surprisingly it doesn slide around or crease on my lid lines. It is easy to blend out with my fingertip or mini beauty blender. I have 3 colors ready but these are so versatile I will be buying more.",
    "time": "2021-12-24T06:13:19.000+00:00",
    "age": "over54",
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "Apursel15",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "I love everything about the Danessa myricks all the color fixes are so amazing! I just wish they had more in store so we could try out in person!",
    "time": "2021-12-22T18:04:28.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "AGNTALPX",
    "rating": 3,
    "recemonded": false,
    "title": null,
    "text": "Color is good but very easy to fade. Sticky but ok for me. I tried it on lips and eyebrows. Lips color was disappearing in several hours. Eyebrows were fine. Didn’t try eyes and checks but did not believe it would stay there longer. Be careful if wearing in moisture surrounding. Should be ok if does not touch any moisture staff.",
    "time": "2021-12-22T02:08:46.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "MNikkila",
    "rating": 4,
    "recemonded": true,
    "title": "Be Careful",
    "text": "I purchased 3 shades: Ballerina, Milky Way and Kaleidoscope. First pay attention to the finish of the color you’re buying and what your intended use is. I usually stay away from multipurpose makeup like this because I find when products try to do it all, they’re not excellent at any of them. However, I do love 2 out of the 3 shades I bought. I’m not sure how anyone could wear the glaze finishes on their eyes… it would literally be like putting lip gloss on your lids… no thanks. So I will be returning kaleidoscope. The other two colors are wonderful and I love the look. I will consider getting more colors but will for sure be staying away from the glaze finish.",
    "time": "2021-12-21T18:12:42.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "arlips",
    "rating": 1,
    "recemonded": false,
    "title": null,
    "text": "Color too intense. Looked like my eyes were bleeding",
    "time": "2021-12-20T05:17:49.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Tanmitchy",
    "rating": 1,
    "recemonded": false,
    "title": null,
    "text": "This product is beyond awful. I initially bought it to use as an eyeshadow topper but figured I’d try it on its own. It made my eyelids a sticky, glittery mess and the product itself was impossible to blend. I will 100% be returning it.",
    "time": "2021-12-19T23:07:00.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "thebinwv",
    "rating": 1,
    "recemonded": false,
    "title": "nothing special",
    "text": "You have better options at the drugstore. This did not blend well and it was nothing special.",
    "time": "2021-12-18T02:32:37.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Denetnet1",
    "rating": 5,
    "recemonded": true,
    "title": "Great pigment",
    "text": "Highly pigmented and buildable. I know this sounds repetitive but a little goes a long way. Be quick with the brush tho, it dries fast once applied. The color is really beautiful ! Easy to blend as long as you work fast! Unlike Kaleidoscope I’m satisfied with this one.",
    "time": "2021-12-18T00:27:40.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "suryea",
    "rating": 5,
    "recemonded": true,
    "title": "super versatile",
    "text": "This product is so versatile. The shade I picked up (Ballerina) has a beautiful shine and metallic finish. The product is smooth and evenly pigmented throughout. A small amount goes a long way. It also does not crease or accentuate fine lines. I use this product as a highlighter, an inner eye corner highlight, a shade all over the lid, and mixed into several different lip products. I swatched some of the matte shades in store and will definitely be picking some up.",
    "time": "2021-12-15T05:46:02.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "SKEEZIX66",
    "rating": 3,
    "recemonded": false,
    "title": "Meh",
    "text": "Very pigmented which I wasn’t expecting. Trying to go light handed was challenging as it dries off very quickly. Colour is pretty so I will continue to try to use it - maybe mixed with some moisturizer (I haven’t tried it on my lips, only on my cheeks).",
    "time": "2021-12-11T18:02:00.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "WH92",
    "rating": 2,
    "recemonded": false,
    "title": "not enough buildup",
    "text": "i imagine that the people who give this product high reviews are using a different formula, or perhaps expecting a sheer result. while the colour is quite beautiful, it really cannot be built up. i waited for the first layer to dry on my lids, then began applying another layer, only to find that the base layer lifted right up!! i tried dabbing, pressing, blotting, smoothing - all very, very gently. it appears one simply cannot build up this product in this formulation/colour. i've given it two stars because despite this, i imagine i will still be able to use it for an art project or a very temporary photo.",
    "time": "2021-12-10T23:14:22.000+00:00",
    "age": "18to24",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "dancelover",
    "rating": 5,
    "recemonded": true,
    "title": "Beautiful",
    "text": "Beautiful color and it stays on all day and it does not flake on your face..",
    "time": "2021-12-08T07:00:07.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "productrater",
    "rating": 5,
    "recemonded": true,
    "title": "Pretty shiny bronze eyeshadow",
    "text": "This was the first DM colorfix that I ever used and it's still my favourite and stands out from all the rest. The colour payoff is strong but this blends out easily and diffuses into a pretty colour, looks like you have several colours on your eyes.. The formula is nice, sets quite fast. I apply it with my fingers and only use a tiny dot and build it up on the lids. I bought Chocolate and did not like it, it was hard to work with.",
    "time": "2021-12-06T23:07:39.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "hazeleyebeauty",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "Love this eyeshadow- bought 2 colors now- a little goes a long way and they stay put.",
    "time": "2021-12-06T21:54:51.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Denetnet1",
    "rating": 4,
    "recemonded": true,
    "title": "looks gorgeous but it smudged my liner",
    "text": "I’m giving this product 4 stars because it smudged my liner after a while. So it kinda moves around after you put it on. I would recommend not to use eyeliner if you’re going to use this. And if you’re going to use it on the face as highlighter wear your hair up because otherwise the hair sticks in the product ! \nOther than that great pigment. I just think I need to play around with it more and find the best ways to get the most outta it !",
    "time": "2021-12-06T17:39:20.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "michb",
    "rating": 5,
    "recemonded": true,
    "title": "truly long wearing formula",
    "text": "I’m obsessed with these. They don’t budge, but I think the swatches suck and they are often darker on than in pics. I use exposed in my crease for a day look. Hope they carry a wider assortment of this product line. I’ve bought several shades already and will probably buy more. A little goes a long way, so the price could be worse.",
    "time": "2021-12-06T04:33:39.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "desertgirl74",
    "rating": 4,
    "recemonded": true,
    "title": "Great Staying Power - Doesn't Budge!",
    "text": "I bought Desert Rose, Chocolate, Clear and Black Out for Halloween (I went as a pirate). A little goes a long long way with this product. I'm glad I practiced with it before applying it for wearing it out. I like Desert Rose for lipstick, it stays on through drinking, eating and other lip activities. LOL. I wish Chocolate was more brown. It has a lot of red undertone to it. It makes for a good deep berry lipstick. After awhile my lips did dry out and I need a lip balm for moisture. The blackout stayed on my lids and as liner until midnight...then it started to crease but I have very oily eyelids. I'll use my Urban Decay eyeshadow primer next time. I'm taking a star off because I wasn't really able to use it as a blush. I mixed with my moisturizer to give it some slip and my cheeks ended up looking splotchy. I think these tubes will last a very long time.",
    "time": "2021-12-04T01:13:08.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "valentinavm",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "I got 3 colors in these, 2 matte and one glitter shade. They’re all incredible. The shade exposed is a great quick everyday all over the eye color for me. Or I have also used it as a base for other looks. It’s long lasting and doesn’t crease. The only thing is that you have to be ready to blend pretty fast, so do one eye at a time. I prefer using a brush to blend it too, I use my finger to apply and then blend it out with a brush.",
    "time": "2021-12-02T21:49:37.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "AubreyJean16",
    "rating": 5,
    "recemonded": true,
    "title": "GET THIS NOW",
    "text": "This is the best liquid eyeshadow on the market!! If you are thinking tambourine purchasing this eyeshadow… do it!!",
    "time": "2021-11-30T22:24:51.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "gugz28",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "Amazing lasting colour. Sometimes it’s a little hard to spread but otherwise it’s amazing colour that lasts forever. I’m excited to try it on my beach vacation as it is waterproof.",
    "time": "2021-11-23T19:33:35.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "scottherron",
    "rating": 5,
    "recemonded": true,
    "title": "Lasts through anything",
    "text": "Got the matte black. Does not budge. I wore it all over my eyes to a heavy metal show. Sweated buckets and even cried during one of the emotional songs. This eye paint stayed in the exact place that I put it. I am very impressed. You definitely don’t forget that it’s there, as it makes your skin feel a bit odd when it’s all over, but I don’t care.",
    "time": "2021-11-22T02:26:18.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "berriturtle",
    "rating": 3,
    "recemonded": false,
    "title": "Beautiful but fades….",
    "text": "Celebration is a pretty light bronze color with shimmer. I use a tiny dot and pat on mostly the outer corners of my eyes then I pat the remaining on the rest of my eye so I get a nice gradient effect. I then put some on an eyeliner brush and line my top and lower lash line. My eye make up looks amazing. The reason I’m giving 3/5 stars is because my eye makeup fades after a few hours. If it lasted longer I would give 5/5. I have oily lids but I do not have this issue with other cream products that state they last all day.",
    "time": "2021-11-21T22:42:19.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "pamelataveras4",
    "rating": 3,
    "recemonded": true,
    "title": "poor shade description for Exposed",
    "text": "Color description for the shade exposed is so off it’s literally pink, no hint of brown/nude/beige as described or pictured at all. Almost wondering if it was a lab miss-print cus ain’t no way.   \nOtherwise lasts all day long blends nicely would have given 5 stars if color was as pictured :/",
    "time": "2021-11-21T21:16:53.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "viktoria73",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "This is the best cream eyeshadow I’ve ever used for $18. I love the CT one but is very expensive so this is perfect and there’s a ton of colors and textures. Recommend 100%",
    "time": "2021-11-20T16:53:30.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "mjbalm",
    "rating": 1,
    "recemonded": false,
    "title": null,
    "text": "This was so difficult to use. Hard to blend and super dark.  It didn’t last.  Would buy product",
    "time": "2021-11-17T16:29:11.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "coachdanielle",
    "rating": 5,
    "recemonded": true,
    "title": "Eye Glitter Heaven",
    "text": "If your looking for the perfect glitter pop THIS IS YOUR SIGN!!! It is thick which allows you to keep it in one place instead of shedding all over your face. Think of a dewy liquid full on eyeshadow but glitter version!",
    "time": "2021-11-16T02:00:40.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "Geestarr",
    "rating": 4,
    "recemonded": true,
    "title": "Pretty great!",
    "text": "I have several of these in matte and foils. The mattes are better than the foils. Be warned - these do NOT move after they're set and they dry FAST, so have a plan. You get about 30 seconds before it's a done deal. They blend nicely with a brush - but hurry! \n\nThe foils are really pretty but inconsistent. Some of the shades are kind of chunky, others are beautiful. Milky Way is one of my favorites.\n\nAs lip colors these all work very well. Lightweight and long lasting.\n\nAs cheek colors they are also beautiful, but use caution! These are VERY pigmented and you only need about the size of a pinhead to get the job done. Tap it into a brush really good and then use a light hand. This also will not move after it's on.\n\nThat said I do love the versatility of these as well as the wear time.",
    "time": "2021-11-11T23:30:26.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "tara12",
    "rating": 1,
    "recemonded": false,
    "title": "extremely sticky",
    "text": "This was probably the worst cream shadow I’ve tried. It was comically bad. When it dried down it became extremely sticky to the point my eyelids were sticking together in my creases. I removed it because obviously couldn’t leave my eyes like that. Also this shade weirdly only left glitter, no actual pigment on my eyes.",
    "time": "2021-11-10T16:22:00.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Jmeeehehe",
    "rating": 5,
    "recemonded": true,
    "title": "Great multi-use products that last on oily skin",
    "text": "I picked up two of these (exposed and kaleidoscope) and I absolutely love them. The matte shade is a little cooler toned in person than pictured on the website, but it makes for an excellent contour shade on my light-medium skin. As an eye product, it lasts quite a long time on my oily lids. It's a little drying on the lips, but lasts through meals, if you're into that sort of thing. The balm shade is fantastic: it's slightly warm toned, and the glitter is super subtle on the face. It's one of the prettiest most natural looking highlights I have tried. One thing I've noticed in other reviews is people complaining that these dry down super fast, which has not been my experience at all. I'm not sure if they vary by shade, but I've had no issue with dropping some on the side of my hand and blending it onto my lid, into my crease, or into my cheekbone before drying. If you're curious about these, grab one, because I really don't think you'll be disappointed.",
    "time": "2021-11-09T19:14:20.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "AmyLynn7178",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "This is really pretty! I use as a highlighter, and it doesn’t loft my foundation or give extra texture. Gives a really nice wet look!",
    "time": "2021-11-09T01:55:05.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "4StarJen",
    "rating": 5,
    "recemonded": true,
    "title": "Glitter for those who hate glitter",
    "text": "I saw one live swatch video of this product and knew I needed to have it. It has been out of stock forever. It finally came back in stock at the start of the sale and ohhhhhhh my goodness is this beautiful. It's super glittery, but washes away so easily. No finding glitter on your face for days. It's gorgeous.",
    "time": "2021-11-09T01:31:58.000+00:00",
    "age": "over54",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "HBGgirl",
    "rating": 3,
    "recemonded": true,
    "title": "not really nude",
    "text": "I was excited to try this from the pictures and color expectation. Beware, this is NOT a nude. It dried down very quickly (which I liked) as a pinky/purple color. The color is pretty but not what is advertised and not what I thought I was buying nor is it some thing that I would wear. I will however try a different color because I do like the matte dry down and what the final look, looks like.  I suggest trying them in store if you’re able to before you purchase.",
    "time": "2021-11-06T17:36:26.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "MissKitty4563",
    "rating": 2,
    "recemonded": true,
    "title": "Exposed is not neutral, VERY red purple undertone",
    "text": "Firstly, the product works! Stays on all day, is easy to blend, and is very pigmented. I can only speak for the matte shades. However the shade 'Exposed' which is what I purchased thinking it would be a nice transition shade, a neutral nude beige is not beige whatsoever.  It's a lot darker than pictured, and has a VERY red/purple undertone, and on me looks like I have an eye infection lol . If you have light/pale skin or even light/medium, this will look pinky purple on you.  It may look a lot more neutral however on a medium, medium/dark skin tone. I'm hoping a lighter neutral shade will be available at some point, and the description of Exposed will be updated, because the formulation is lovely!",
    "time": "2021-11-02T18:27:49.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "qrkymerlot",
    "rating": 5,
    "recemonded": true,
    "title": "Beautiful color",
    "text": "Fantastic color. Taupe-y brown with a slight shimmer. Perfect middle ground between brown and gray. My favorite color yet!!!!!",
    "time": "2021-10-28T16:56:50.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "poepoe",
    "rating": 3,
    "recemonded": true,
    "title": "Halfway disappointed",
    "text": "I was more excited for these to arrive with my order more than a kid on Christmas but I can only half recommend them. I have Wild Orchid (shimmer) and Valentine (matte). I'm 52 with slightly hooded eyes, oily lower lids, drier upper lids, and the usual wrinkles and textural difficulties of someone my age. I also don't see well without glasses so I had planned on using these as a sweep of color just on my lower lids instead of anything precise since I can't see well enough for detail application. \n\nIt dries really, really fast, you have to work very quickly so it will take a good amount of practice.  A tiny bit goes a long way so just squeeze a tiny dot. The matte shade applied evenly and I was able to build up the color in the socket and let the rest stay a little more sheer. Both the denser and lighter application turned out really nice. As a blush it dried way too fast to blend. On the lips it seemed it would be a good lip stain but it didn't last through lunch like other lip stains often do. \n\nWild Orchid was very patchy. Building up definitely did not work because of the shimmer texture. The shimmer ended up falling under my eye and on the very tops of my cheekbones. It basically ended up looking like textured, patchy mud on the lids with flecks of glitter in places I didn't want glitter. \n\nThese aren't sold in stored but a few weeks ago the store near me had 5 shades for a limited time and I tried Ballerina (shimmer) on the back of my hand and the texture was wonderful on my hand so I don't know why Wild Orchid is so bad even though it's the same texture and finish. The sales associate told me to get the clear one as well because according to him,  it \"locks\" in the color but I highly doubt that's what it's used for. \n\nSo, I was halfway disappointed with my purchase. I may see if Wild Orchid would work as an eyeliner but don't have any hopes. \n\nThe matte lasted much longer while the shimmer transferred to my upper lid.",
    "time": "2021-10-23T05:55:11.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "mkenzie72",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "Wow! I really like it as a blush and as a lip colour. Haven’t really tried it out on my eyes as an eyeshadow yet though.",
    "time": "2021-10-23T01:02:57.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "swyhte",
    "rating": 5,
    "recemonded": true,
    "title": "Great product for a variety of looks!",
    "text": "So pigmented; a little goes a very long way. In the pic I used it all over for a everyday look, but I’ve just applied like cream blush over a full beat(powdered face, contour) as well.  I want more colors! Remember a little goes a very long way. It can be sticky as a matte lip color.",
    "time": "2021-10-22T19:02:53.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "TiffTiffMarie",
    "rating": 5,
    "recemonded": true,
    "title": "I’ve Neglected Everything Else!",
    "text": "I have so many shades! They’re so easy to use and blend smoothly with one another. A drop goes such a long way. I always have to make sure I’m not squeezing out more than I need. You can mix them together and create any shade you want. I barely touch my palettes anymore. Danessa Myricks is a wizard!",
    "time": "2021-10-21T04:18:51.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "kaylaharnae",
    "rating": 5,
    "recemonded": true,
    "title": "Fresh, dewy, and light!",
    "text": "I received a gift card to select a product of my choice to review. Very fresh and dewy. The perfect product for your everyday makeup look. You can wear it to the gym or to work, your choice. Love the freshness it gives and it always makes me feel that more awake and ready for the day.",
    "time": "2021-10-20T00:39:19.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "true"
  },
  {
    "name": "jessicalocklear",
    "rating": 4,
    "recemonded": true,
    "title": "multi-use product, great value + pigment!",
    "text": "a really versatile, beautiful pigment. I used it on my eyes, cheeks, and lips. it can be a subtle wash of color, or it can be a really stand out pigment. I found some irritation on my eyes, but it would’ve been another new product I used. a tiny bit goes a really long way, so I’d experiment with different techniques (brush, sponge, fingers, etc) before applying to the face. this color was a good neutral reddish, I liked it the most on my cheeks.",
    "time": "2021-10-17T20:14:41.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "PADMA22",
    "rating": 5,
    "recemonded": true,
    "title": "Great pigment",
    "text": "I've been on the hunt for years to replicate that rosy \"just went for a run\" look that my cheeks get when I workout and the blushes I thought were close were either too red or pinky and artificial looking, so I saw Latte and I was worried it would be too dark on my light medium skin but its not! It blends *s e a m l e s s l e y* into a healthy flush that looks exactly it's my own skin and not makeup. The texture is unlike any cream or liquid blush I've tried, it evenly disperses the pigment as you blend it in with your fingers or a foundation brush and you don't have to worry about over doing it",
    "time": "2021-10-15T20:59:49.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "true"
  },
  {
    "name": "tatiigardner",
    "rating": 5,
    "recemonded": true,
    "title": "Great Pigment!",
    "text": "Such a gorgeous color!! I was worried that it wouldn’t show or it would oxidize weird on my skin tone but it looks perfect. It’s super pigmented and has such a beautiful finish.",
    "time": "2021-10-15T14:45:27.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "true"
  },
  {
    "name": "MichelleDaBelle",
    "rating": 4,
    "recemonded": true,
    "title": "stunning but…",
    "text": "I received a gift card to select a product of my choice to review, all opinions my own!!\n\nan absolutely gorgeous shade that goes from a pink to strong gold reflect.  easy to apply, super high shine and sparkle, strong flip, amazing staying power, and no fallout!  my only caveat is that it has a fairly sheer base, which makes it ideal for use as a topper.  if you continue to apply it as it’s drying, it can lift and become a little patchy (see second photo).  however, i’ve found if i work quickly and don’t go back to fix while it’s drying, i have no issues. \n\noverall really beautiful shade that i love to amp up eye looks with",
    "time": "2021-10-15T12:50:49.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "true"
  },
  {
    "name": "emilyfern0730",
    "rating": 5,
    "recemonded": true,
    "title": "great product!",
    "text": "I received a gift card to select a product of my choice to review\n\nI overall loved this product! I love how smooth it goes on and the color is GORGEOUS. I did a messy euphoria type of look and liked it! A little goes a long way, I used too much and it did not look good at first. I used a thin angle brush to do an eyeliner look with it and it was easy.",
    "time": "2021-10-15T04:11:39.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "true"
  },
  {
    "name": "BrittW23",
    "rating": 5,
    "recemonded": true,
    "title": "Fabulous Lip Cream Pigment!",
    "text": "I received a gift card to select a product of my choice to review!  I chose Danessa Myricks Beauty Colorfix Eye, Cheek and Lip Cream Pigment.  This product is multifaceted, multipurpose and overall a great buy!  The application is smooth and not chalky dries quickly and is lightweight! I wore it as a lipstain and an eyeshadow!! It also goes well with my complexion. I would and plan on buying different colors to have more to choose from! This is Brittany Approved! \n\nThank you Sephora!",
    "time": "2021-10-15T03:34:22.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "true"
  },
  {
    "name": "Lana26",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "I received a gift card to select a product of my choice to review. I choose primary red. If you love long wearing vibrant matte colors, you’ll like this brand and color. Its a deep red that I think it’ll look great on anyone, it reminds me of ruby woo from MAC but the only DIFFERENCE is that it wears for a VERY long time and it doesn’t transfer under your mask.",
    "time": "2021-10-15T03:25:29.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "true"
  },
  {
    "name": "slaywithnay",
    "rating": 5,
    "recemonded": true,
    "title": "So much pigment!!",
    "text": "I received a gift card to select a product of my choice to review, and I had to get my hands on this Danessa Myricks Beauty pigment! Cupcake is a BEAUTIFUL mauve color that compliments my deep skin tone so well. I used it as a lip color and a bit on my cheeks as well. The pigment is opaque and doesn’t separate even after long wear. I’ll definitely be trying more shades!!",
    "time": "2021-10-15T03:24:47.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "true"
  },
  {
    "name": "amandaglam",
    "rating": 5,
    "recemonded": true,
    "title": "A beauty game-changer!!",
    "text": "I received a gift card to select a product of my choice to review. This is such a great product to have in your collection. Truly a game-changer. I've used this as a blush, lip color, and eyeshadow, it makes such a gorgeous monochromatic look. A little bit goes a very long way with this product, all I needed was a single dot for a very pigmented look. I also noticed this product is long-lasting and lasts all day. I'd recommend this and I'll be buying more shades soon.",
    "time": "2021-10-15T02:55:18.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "true"
  },
  {
    "name": "s0ftbabyangel",
    "rating": 4,
    "recemonded": true,
    "title": "beautiful eye gloss!!",
    "text": "I received a gift card to select a product of my choice to review. This is prefect for creating editorial-style glossy eyelids! The small nozzle makes it easy to apply where you want it, and its very easy to work with. I like to apply it using a flat eyeshadow brush, but fingers also work well. The little flecks of micro glitter don't feel too gritty, and it leaves a gorgeous high-shine finish. \n\nThat being said, be sparing with your use! Applying too much could lead to it seeping into your eyes - admittedly this gloss has a lot less body than I expected it have. Remove this using an oil based cleanser, such as a cleansing oil, cleansing balm, or miscellar water - anything else will be a struggle.",
    "time": "2021-10-15T01:15:20.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "true"
  },
  {
    "name": "chinezeslife",
    "rating": 5,
    "recemonded": true,
    "title": "a multi-use GEM!",
    "text": "I received a gift card to select a product of my choice to review\n\nit’s the bold pigment for me!  a little goes a LONG way with this product, so don't be intimidated by the size.  i love that this formula is buildable, and blends out like a dream. i use it primarily as a blush (pictured), however it’s great as an eyeshadow too.  this shade compliments my brown skin so well, i can't wait to get more colors!",
    "time": "2021-10-15T00:18:42.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "true"
  },
  {
    "name": "oakoreo",
    "rating": 4,
    "recemonded": true,
    "title": "Wowow",
    "text": "I received a gift card to select a product of my choice to review. \nI was immediately drawn to this 3-in-1 product because I thought it’d be perfect for travel. I’m really into orange red tones for both my lips and eyes so I gravitated towards “rustic” and it’s such a beautiful color! I was amazed at how pigmented it is and how easy it is to apply. For a dark shade I was afraid it wouldn’t be blend easily but it does!! It’s so lightweight that it doesn’t feel like I’m wearing lipstick. Even on dry lips bc of the cold season, it went on nice and smooth!",
    "time": "2021-10-14T23:47:36.000+00:00",
    "age": "18to24",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "true"
  },
  {
    "name": "Dewilka",
    "rating": 5,
    "recemonded": true,
    "title": "Perfect all-in-one routine",
    "text": "Your ideal all-in-one face product! I love how multi-purpose and how travel friendly it is. Easy and perfect for on-the-go mornings or light pack trips. The color is gorgeous! and the color pay off is more than you'd expect. Gorgeous plum color, great for fall. Super easy to apply, non-sticky, non-tacky texture. Doesnt look too glossy, perfect texture. Perfect addition to a simple makeup routine.",
    "time": "2021-10-14T22:44:20.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "true"
  },
  {
    "name": "chizoba",
    "rating": 5,
    "recemonded": true,
    "title": "Glaze (clear)",
    "text": "“I received a gift card to select a product of my choice to review“ \n\nI am new to the world of lip glosses and decided to pick the glaze clear color, and let me say I was skeptical at first but I can never leave my house without it! It goes perfectly with any look and any lip liner! Throw on your fav lip liner and this gloss and you have a nice nudish look!",
    "time": "2021-10-14T21:11:38.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "true"
  },
  {
    "name": "NiaImanii",
    "rating": 5,
    "recemonded": true,
    "title": "Danessa Myricks is that Gworl!!!",
    "text": "I absolutely love this product!! I received a gift card to select any product of my choice, and I chose the foil in the shade mermaid. A little goes a long way and it dries pretty quickly. I find the best way to apply this product would be with a synthetic flat brush. Using a natural hair brush will only soak up product, and the application won’t be as seamless. I love this shade on my complexion, and I can definitely see myself purchasing more shades in the future!!",
    "time": "2021-10-14T20:46:12.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "true"
  },
  {
    "name": "tinycupofcake",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "I received a gift card to select a product of my choice to review. \n\nDanessa Myricks Beauty is a new brand to me and I am very pleasantly surprised with this product. I don't experiment much with eye color but I do like to wear a matte black liner each day. I find the liquid eyeliner pens to dry out often so I will use eyeshadow as an alternative - unfortunately that smudges easily. This product in Blackout is a true black, dries matte, and does not budget even without a primer!",
    "time": "2021-10-14T19:49:34.000+00:00",
    "age": "18to24",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "true"
  },
  {
    "name": "HollieNewlin",
    "rating": 5,
    "recemonded": true,
    "title": "Excellent multipurpose pigment!!",
    "text": "* I received a gift card to select a product of my choice to review *\nI am so very pleased with this Waterproof Matte Liquid Pigment for eyes, lips and checks from Danessa Myricks Colorfix™️!! I'll be honest, I'm usually not a fan of multipurpose products like this. They typically work great for one thing but not so much the others. But this cream pigment actually does work as a multiuse  pigment! It's excellent for use on the eyes, the lips AND the cheeks - all 3 equally as good! I love the texture of this cream pigment! It's super lightweight and silky. It's absolutely effortless to apply and blend with either a brush or finger. And it's not greasy or sticky at all like a lot of liquid/cream pigments tend to be. The shade Latte is a gorgeous matte and would look amazing on any skin tone! It's not too 'pinky' looking either. It's more of a deeper, dusty rose color that just looks so pretty. It's also highly pigmented and just a little bit goes such a long way. The formula dries down quickly, is completely crease-proof, waterproof, smudge-proof and has some serious staying power. It literally lasts me all day without needing to ever reapply. Plus this pigment is easy to layer with other shades or use alone for a dramatic pop of color. I can most definitely see why this cream pigment is an Allure Best of Beauty Winner! I'm so excited to try out some of the other colors and finishes! Highly recommended!!",
    "time": "2021-10-14T17:29:07.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "true"
  },
  {
    "name": "Lyzmarie",
    "rating": 4,
    "recemonded": true,
    "title": null,
    "text": "*I received a gift card to select a product of my choice to review*\n\nI love to get creative with my makeup sometimes and so I decided to try Danessa Myricks Colorifix, finally. First of all, you only need a little bit to get what you want. If you think you only squeezed out a little bit, it's still too much, LOL. \n\nI absolutely love the color I chose and it gives enough play time before it dries completely. I find that you can layer shadows on top but I prefer to use this for more simple, statement looks.  Also, I suggest using an oil based makeup remover. xD",
    "time": "2021-10-14T02:59:43.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "true"
  },
  {
    "name": "lizzyruiz",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "received a gift card to select a product of my choice to review, and I chose this amazing product. First of all, ...WOW! This product is truly amazing. It's very pigmented and long lasting. It does dry pretty quick so you have to move fast. If you want a subtle color, start with less and gradually add more for a more darker look. A little does go a long way. I loved it!",
    "time": "2021-10-13T23:21:42.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "true"
  },
  {
    "name": "glowwithjess",
    "rating": 5,
    "recemonded": true,
    "title": "THE PIGMENT WOW",
    "text": "this is a beautiful, smooth and easy to work with pigment. I absolutely love it!",
    "time": "2021-10-13T21:15:03.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "Shikhs",
    "rating": 5,
    "recemonded": true,
    "title": "Love it!!",
    "text": "I received a gift card to select a product of my choice to review and I chose the shade \"Alien - rosy gold foil\". I was looking for some pigment that gives a glam look and at the same time which is easy to apply and this is exactly what I wanted. Something that can give a dazzling look in just a minute. Moreover, there was no fallout and the shimmer lasted so long. I used this for my eyes and I love the pinkish golden color so much. I am sure I will buy more variants of it to use on my cheek and lips as well. I love this 3-in-1 pigment.",
    "time": "2021-10-13T19:11:41.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "true"
  },
  {
    "name": "mlfreder",
    "rating": 4,
    "recemonded": true,
    "title": null,
    "text": "Very nice shade! It isn’t overly chunky or glittery but I found it dried down pretty quickly on my finger so I had to moved fast. I will use a brush from now on to see if that helps. Love the convenience of this being in a tube & a little goes a long way. Works well with the powder shadows I use as well.",
    "time": "2021-10-13T16:57:55.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "true"
  },
  {
    "name": "bpfort",
    "rating": 5,
    "recemonded": true,
    "title": "Built to last!",
    "text": "I received a gift card to select a product of my choice to review, and I chose this amazing product! The founder knew what they were doing with this product. At first I was nervous but once I put this on, I became a HUGE fan. I tried it on my lips first to see how long it would last, and it lasted a full day without any smudging–it lasted through coffee breaks, lunch, tabling on campus, and taking my mask on and off! If you ever need one product that catches everything (especially for a long day) I would totally choose this! The other great thing about this product is if you’re wanting to try a new color for your lips (or eyes or cheek) but are unsure you can always keep the product and use it for another part of your makeup routine. This was a BIG plus for me since I hate returning stuff and now I can try a product that I can use for different purposes…a win-win!",
    "time": "2021-10-13T02:47:56.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "true"
  },
  {
    "name": "astfashionista",
    "rating": 5,
    "recemonded": true,
    "title": "Perfect for any everyday makeup routine!",
    "text": "[I received a gift card to select a product of my choice to review.] I’m not a big makeup girl. Give me a good foundation, concealer and nude eyeshadow and I’m good to go! I was looking for a product that was easy to use and easily goes with my everyday makeup routine and I love this Colorfix Eye, Cheek & Lip Cream Pigment! It makes for a beautiful eyeshadow and I love putting it on my lips and cheeks when I want to add a little color to them. This product is so pigmented too!",
    "time": "2021-10-12T20:19:45.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "true"
  },
  {
    "name": "aimscray",
    "rating": 1,
    "recemonded": false,
    "title": "Disappointing",
    "text": "I’m so disappointed in this. I was so excited to try it because my eyelids have become puffy and creepy and powder just accentuates this. I really thought this was the answer but the color is so so wrong, among a couple of other things, unfortunately. I should have known when I tried the brown matte color. To be fair, the description says “berry brown”, but it’s more like berry with a hint of brown. The “nude beige matte” as the Exposed color is described is very similar. It’s more of a very pink mauve. Beige it is not. I looked like I was either in the midst of an eye infection or had just gotten a slug in the face. I’m sure the color looks nice on some skin tones but I really wish this was the color described. In addition, it stayed quite sticky on my lids. I thought I might have better luck using it as blush but it settled in my pores something fierce! On to the lips: a total mess! One thing I will say: this seems like it would be water and transfer-proof on the eye lids. That said, it broke up and cracked on the lips. I really really hope the formula and color get an update because I love the concept.",
    "time": "2021-10-11T22:43:29.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "fabcocktail",
    "rating": 5,
    "recemonded": true,
    "title": "Subtle and long lasting",
    "text": "I received a gift card to select a product of my choice to review. I’m one who doesn’t love a ton of makeup so I was pleasantly surprised just how subtle it was. The color was long-lasting on my lips (I forgot to take it off at night lol and it’s still on me a little bit the morning!) and I also used it as an eye shadow when I went out for dinner and drinks. This is the perfect color for any skin tone. And it’s a GREAT beginner shade for anyone looking to step up their makeup game. Very, very impressed. Also a great price for basically a lippie, eye shadow and blush all in one. Next time, I will most likely put on another coat to make it darker.",
    "time": "2021-10-08T13:08:38.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "true"
  },
  {
    "name": "BreezBeauty",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "I love this multitasking formula! It’s perfect for days when you want a beautiful quick application , one product for is a go for me ! It’s long lasting and the shades are so pretty !",
    "time": "2021-10-04T18:39:17.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "Samcro",
    "rating": 5,
    "recemonded": true,
    "title": "dummy proof multi tasking make up",
    "text": "Easy makeup for those out there who like to use our fingers and maybe one brush to apply all our products and yet don’t have any expert make up skills by far, I have a ton of make up and skin care products I can’t resist I admit I am a product junkie even my daughter who does have excellent skills teases me and says are you putting together a make up and skin care museum? don’t get me started on what my husband says when my Sephora delivers show up daily! Lol! but here’s the thing there is a method to my madness and I still do very extensive research before purchasing any make up or skin care product and this versatile easy to use little gem just blows me away!!! I have about 15 colours already but I will comment on a few specifically. Ok first a little tiny tiny bit goes a long way, u can either use a make up palette or the back of ur hand put a small dot of the product and then start the magic, dip in with ur finger or brush it’s a very creamy texture and it can be blended and layered well for colour impact from a light wash to exactly the Colour in the tube, it has incredible play time so if your like me and need more then 5 seconds to blend and layer ur make up this product gives u that extra few seconds. Now I have dry skin and mature skin so the creamy texture is perfect for me catch the key word creamy not greasy however once it dries this product is locked down I also use my favourite eye primer, I have several I like, which also helps hold the colour true prevents fading or creasing, that being said when I finally got a hold of rustic I was so excited to try it I forgot a primer and boy can I say I was very impressed with the colour it really popped against my blue eyes and didn’t fade or crease I am an RN who works 12 hour shifts and there is nothing worse then make up sliding off my eyes and down my cheeks yuck and oh the colours and finishes available to play with in this line well worth giving it a try",
    "time": "2021-10-02T04:46:29.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "DollfaceDredie",
    "rating": 5,
    "recemonded": true,
    "title": "Best Black Liner on the market!",
    "text": "Lowkey the best liquid black liner on the market. Such a versatile product too that works as paint or liner. Super pigmented and dries matte and waterproof! Absolutely incredible. Must have for any pro kit; super sanitary packaging too. I’ve had mine for about a year and it hasn’t dried up. Personal fav!",
    "time": "2021-10-02T00:29:54.000+00:00",
    "age": "18to24",
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "tott",
    "rating": 5,
    "recemonded": true,
    "title": "The Ultimate Multitasking Product",
    "text": "The colorfixes are one of my favorite products to use in my collection. They are super versatile & can be used in multiple steps of my makeup routine. I love mixing them to create custom colors as well!  I use at least one every time that I do my makeup.",
    "time": "2021-10-01T14:00:48.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "BrazilRaine",
    "rating": 5,
    "recemonded": true,
    "title": "Team No-Fallout! You've gotta try this!",
    "text": "10/10 LOVE and recommend this product! Think liquid glitter, no fallout EVER! It's absolutely stunning, can be used sheer or built up heavily. I am posting two photos, one of Mermaid (teal w/duochrome finish) and another of Milky Way (silvery/white) so you can see just how versatile the products are. For the photo with the lighter shade I used Milky Way as a highlighter for face and body as well as the eyeshadow. \n\nIncredible high shine finish, beautiful, easy to blend and build texture, plus all day wear! What more could I ask for in a glitter product. A must-have!",
    "time": "2021-09-30T16:00:13.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "ciaraFYB",
    "rating": 5,
    "recemonded": true,
    "title": "Colorfix is the new way to eyeshadow!",
    "text": "Colorfix are by far one of my most used products! One drop can create an entire look, it’s pigmented, light and will last ALL DAY.  Absolutely amazing for editorial and everyday wear. 10/10 forsure!",
    "time": "2021-09-30T11:00:19.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "NataliaNG",
    "rating": 5,
    "recemonded": true,
    "title": "My survival product ❤️",
    "text": "I am make up artist and For me Colorfix it is my survival product - even sometime if I can’t take a lot products to my job - always I have at list 5 shades of Colorfix. Colorfix unique product which is   possible to use for lips, eyes, face. Also what is important it is easy to blend , easy to mix with another products, long lasting, waterproof.  I love to mix Colorfix with oils, lip balms. Nude Colorfix possible to mix with foundation to have more coverage….. omg I can talk hours about Colorfix. I can’t tell which shade I like - I love all shades from my collection. I use Colorfix not only for job. I use it for my self, and this is my must have product when I pack for holidays: small packages, multiple possiblity to use .",
    "time": "2021-09-29T17:03:01.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "liviavarga",
    "rating": 5,
    "recemonded": true,
    "title": "Love, love!!",
    "text": "I absolutely love Danessa Myricks colorfix pigments, i thing i have all of the colours. Very easy to blend and stays on all day.",
    "time": "2021-09-29T13:09:51.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "Afshie87",
    "rating": 5,
    "recemonded": true,
    "title": "I love the versatility and color!",
    "text": "A stunning color to use on the eyes, lips or cheeks. Blends like a dream and doesn’t budge!",
    "time": "2021-09-29T07:55:25.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "Afshie87",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "If you want to lift your eyeshadow look add a bit of ColorFix foils on top for an intense shimmer. I love using Venus for that hot pink foiled look with flecks of gold and green shift.",
    "time": "2021-09-29T07:50:34.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "Afshie87",
    "rating": 5,
    "recemonded": true,
    "title": "Looooove!",
    "text": "Oh I love this ColorFix shade so much! Beautiful blue shift that blends like a dream and doesn’t budge all day! Super versatile, you can wear as an eyeliner, use as a topper or swipe across the lid or lips.",
    "time": "2021-09-29T07:34:57.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "Afshie87",
    "rating": 5,
    "recemonded": true,
    "title": "You need this in your makeup stash!",
    "text": "I use ColorFix practically every time I do my makeup and Crème Brûlée is one of my favorite shades. It’s a beautiful mauvey pink that will suit all skin tones. I love traveling with this as it’s a one and done for eyes, lips, and cheeks! You can’t go wrong with this product! Best part is that it doesn’t budge at all throughout the day!",
    "time": "2021-09-29T07:31:00.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "genart",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "I love all of the colorfixes that I’ve been able to get my hands on so far. This metallic blue one “mermaid” is my fave! It beautifully reflects the light and I’ve been able to create so many looks with it. The thing I love the most about colorfix is that it has a multipurpose function so you can use it on the lids, cheek, and lips.",
    "time": "2021-09-28T21:11:02.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "odilis",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "One of my favorite Colorfix color to use on brides, on commercials works as a nude color, I mix it with Rustic Colorfix when I need it on the peach range. It is waterproof.  A must have!",
    "time": "2021-09-28T17:44:58.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "sourpatchsunshi",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "Love love love, i fell in love with danessa because of this product",
    "time": "2021-09-28T17:22:53.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "Marcela1204",
    "rating": 5,
    "recemonded": true,
    "title": "Beautiful Waterproof Colorfix!",
    "text": "This Colorfix is my absolute favorite!! I’ve used it for the cheek , lips and eyes and the coverage is beautiful! I’m a makeup artist and the brides love this creme brulee color and it’s waterproof ! Definitely a must have!!",
    "time": "2021-09-28T16:26:10.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": null,
    "rating": 5,
    "recemonded": true,
    "title": "Purple metallic goodness",
    "text": "Stunning high shine multiuse product!! I especially love using this shade as an eyeliner as well as mixing it with Lift or Beaches to get a pale lilac colour. This shade is great to add on top of the mattes too to create an awesome metallic finish",
    "time": "2021-09-28T03:01:09.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": null,
    "rating": 5,
    "recemonded": true,
    "title": "Fave yellow eyeshadow ever!!",
    "text": "The Primary colours from Danessa Myriks are a must have for your kit as they can mixed with any other colours to get the shades you want! my favourite yellow eyeshadow!!!",
    "time": "2021-09-28T02:56:06.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": null,
    "rating": 5,
    "recemonded": true,
    "title": "best matte white that doesn't budge!",
    "text": "I love using Lift so much! it works as a mixing shade for other colours to create lighter or pastel shades. I also love using this as eyeliner and as mascara. Colourfix is waterproof so it wont budge when its on the lashes! an be used on the lips, cheeks, lips and as facepaint!",
    "time": "2021-09-28T02:53:14.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "MayaSolis",
    "rating": 5,
    "recemonded": true,
    "title": "The best product for glossy lid!",
    "text": "I truely believe that this is a must have product for every makeup artist. I think I have all of the colour and type of colorfix. But my favourite is this clear glaze. It’s the perfect clear gloss for glossy lid or lips. It stays on for a long time and it doesn’t feel sticky at all. I can’t do glossy lid with any other product but this one!",
    "time": "2021-09-28T01:34:35.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "LoveOnomz",
    "rating": 5,
    "recemonded": true,
    "title": "Magic in a Tube!!",
    "text": "Beautiful shade of purple, super pigmented, not patchy at all, even tho it’s cream it does dry fast but you can still have a bit of play time with it depending on how fast you work. Super amazing for editorials! Love it!!\nAnd if you are a working MUA like myself, this is a must have product in your kit honestly you’d be sold!",
    "time": "2021-09-27T19:29:54.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "LoveOnomz",
    "rating": 5,
    "recemonded": true,
    "title": "Who doesn’t love a good Orange!!",
    "text": "My love for Colorfix knows no bounds honestly one of the most versatile product I own in my kit. Carrot top is most definitely an essential shade, 10/10 recommend! \nLove how this particular shade of Colorfix has multiple uses ( I use it as a liner, as blush; gosh it’s such a beautiful blush shade, as a corrector; yes you heard right, as an eyeshadow etc) basically the list is endless with this shade which is why I love it! \nThe color does appear vivid but can also be worn sheer as well.  \nI love using this shade on Medium to Deep skin, it goes on so beautiful and compliments their skin tones.",
    "time": "2021-09-27T18:38:39.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "StarEtoile",
    "rating": 5,
    "recemonded": true,
    "title": "Extraordinary",
    "text": "Extraordinary vibrant colors, high performance water resistant , makeup with this product is truly spectacular...I love it so much",
    "time": "2021-09-27T11:58:29.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "PolinaPerminova",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "MUST HAVE for everyone who loves creative/editorial makeup. Very easy to blend, gives you great cover and stays on place all day.",
    "time": "2021-09-27T10:07:53.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "sydneynoels",
    "rating": 5,
    "recemonded": true,
    "title": "Colorfix Glaze Is a Must-Have",
    "text": "The Colorfix Glaze in “Clear” has an undefeated gloss formula. It plays well with other lip products, doesn’t leave my lips feeling heavy with too much product, and even stays well when I eat or drink. It’s a near-perfect universal gloss. Just remember: A little product goes a LONG way!",
    "time": "2021-09-26T21:40:35.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "Angelleeartist3",
    "rating": 5,
    "recemonded": true,
    "title": "Oh how I love Colorfix, let me count the ways!!!!",
    "text": "Colorfix is a waterproof pigment that comes in an array of colors and finishes and their uses are boundless!!!! Listen, from brows to eyes to lashes to concealer & foundation to blush to contour to bronzer to highlighter to lips….. the list it legitimately endless! Colorfix has saved many looks of mine! No matter what purpose you think you have in mind for colorfix, she’s going to blow your mind!!!!",
    "time": "2021-09-26T14:22:39.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "Pablito162",
    "rating": 5,
    "recemonded": true,
    "title": "The best metallic blue.. PERIODT!",
    "text": "A true blue and somewhat turquoise fantasy. Honestly the metallic payoff of this baby is killer!! Everyone loved my makeup. The best part is it stayed after sweating and dancing a whole night. Still shocked …",
    "time": "2021-09-26T13:44:53.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "marianadae",
    "rating": 5,
    "recemonded": true,
    "title": "Mix it up and WOW",
    "text": "Don’t be afraid. This is a MUST in any kit. It can be applied even with your fingers and the result is always WOW. Last all day(and night), so versatile and you can change it up any way you wish by just mixing. Such a winner product!!",
    "time": "2021-09-26T10:24:23.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": null,
    "rating": 5,
    "recemonded": true,
    "title": "Glossy must have",
    "text": "I am absolutely obsessed with Colourfix Clear glaze!! You can use it on the eyes or the lips for a super comfortable, non sticky glossy look! I especially love using this when I am doing editorial make up as it gives you that amazing glossiness and high impact in seconds.",
    "time": "2021-09-26T09:37:23.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "makeupbyviviana",
    "rating": 5,
    "recemonded": true,
    "title": "Colorfix is it!",
    "text": "Love colorfix! Game changer in the beauty world. I hardly use my powder eyeshadow because I’m always reaching for my colorfix!",
    "time": "2021-09-26T07:13:26.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "precious4anyone",
    "rating": 4,
    "recemonded": true,
    "title": "nicely pigmented but make sure you blend quickly",
    "text": "I have this orange color as well as Milky way which is a white shimmer. both are bold colors. both are flattering on deep/dark skin tones as long as you know how to coordinate the colors of your makeup.  I will also say that when applying quickly blend the shadow because it does dry down quickly. the orange does run a bit patchy BUT start with a small amount on Lid and then blend out and it will look nice. ive posted 2 pictures. one of me wearing the orange matte with the blue Victoria Beckham eyeliner. the other picture is of me wearing milkyway with a dark blue Nude stix matte shadow .",
    "time": "2021-09-26T05:58:53.000+00:00",
    "age": "35to44",
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "JasmyneElise",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "This is the perfect deep purple. It’s more of a Concord grape… Not too red or raisin hue. It gives a hint of metallic shimmer and dries down quickly. It doesn’t move! Gotta love it!",
    "time": "2021-09-26T03:25:52.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "Angelinambeauty",
    "rating": 5,
    "recemonded": true,
    "title": "A must have!",
    "text": "ColorFix Clear Glaze is the #1 most used product in my makeup kit. It's super high shine without being sticky or heavy. This is the secret to the perfect editorial glossy eye! I also use it often for glossy lips or a wet look cheek glow.",
    "time": "2021-09-25T20:16:17.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "MT0428",
    "rating": 5,
    "recemonded": true,
    "title": "Primary Red ColorFix",
    "text": "I absolutely love DM ColorFix pigments. The colors so bold and long lasting . They are so easy to apply and blend . I love that with that these multitasking products can be applied on eyes , lips and cheeks. I own every single color and I will never go without in my professional makeup kit….",
    "time": "2021-09-25T18:41:25.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "JasmyneElise",
    "rating": 4,
    "recemonded": true,
    "title": "The Perfect Orange",
    "text": "Sis, you need this! I use this for everything. I use it as a blush, color corrector, lipstick, transition for my crease and eyeshadow too! Just get it! Now!",
    "time": "2021-09-25T18:33:10.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": null,
    "rating": 5,
    "recemonded": true,
    "title": "Best matte black eyeshadow and eyeliner",
    "text": "The best matte black eyeliner and eyeshadow I've ever used! this is the only product that doesn't budge in the waterline which is amazing! Great for eyeliner, smokey eyes and creative make up. The best bit is there are no fall out. A must have for the kit. I'd recommend working quickly with this product as it sets quickly",
    "time": "2021-09-25T18:07:59.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "iamluca94",
    "rating": 5,
    "recemonded": true,
    "title": "Colorfix game changer",
    "text": "Colorfix is a game changer since I have colorfix I don‘t use powder shadows anymore because the pigment will be never at the same level like colorfix. And the best part of it is the endless options using it. By the way exposed is perfect to contour the face on fair skin tones. Once you go colorfix you never go back to traditional eye shadows.",
    "time": "2021-09-25T16:54:48.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "kirichmua",
    "rating": 5,
    "recemonded": true,
    "title": "My perfect multifunctional product",
    "text": "My favourite liquid shadow!!\nI luv every formula of colorfix, especially neons and glosses. They dry fast, stay long and never leave me in a rain cause they’re 100% waterproof. They are really pigmented so I need only one drop of product to make a whole look (perfect product for one drop challenge btw). Also they are very multifunctional, I can use em as a liner, as an eyeshadow, as a lipsticks, blushes, mascaras, even on my waterline! Everywhere. Also I love to mix metallics with the dew wet balm and make a custom highlighter. I add pictures with sum swatches and two looks where I used colorfix neons, mattes and glosses both on eyes and lips. Definitely gonna buy every shade one day",
    "time": "2021-09-25T16:38:36.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "Marvelann",
    "rating": 5,
    "recemonded": true,
    "title": "Brown Liner for the Win",
    "text": "The most perfect brown, I love using as a liner but also works amazing as a lip liner!",
    "time": "2021-09-25T03:14:19.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "makeupbyemoney",
    "rating": 5,
    "recemonded": true,
    "title": "Powerful Color",
    "text": "Once you buy these you’re addicted. I love the color & how it looks all over the face",
    "time": "2021-09-25T00:39:50.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "kyleryanbeauty",
    "rating": 4,
    "recemonded": true,
    "title": "liquid cream pigments that stay all day!!",
    "text": "Love colorfix! These liquid cream pigments are so good to use all around the face! I love using the shimmers for bridal makeup on eyes and love using the nube tones for lips, eyes and cheeks!! Love that they have different formulas for different finishes!!",
    "time": "2021-09-24T22:47:56.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "pepperbeauty",
    "rating": 5,
    "recemonded": true,
    "title": "BYE BYE EYESHADOW",
    "text": "There’s nothing on the market like colorfix, period! You can use it on eyes, lips and face. I know it may seem intimidating however I promise you, with some playing around you’ll get it in no time. Check out Danessa Myricks on Instagram for plenty of demonstrations within her IGTV or reels. One drop is all you need! You’ll never view doing your makeup the same again. All you’ll need is colorfix.",
    "time": "2021-09-24T22:25:38.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "Djene",
    "rating": 5,
    "recemonded": true,
    "title": "ONE STEP EYESHADOW",
    "text": "This is your one stop shop! Eyes lips and cheeks. The power of three is Danessa’s rule and I’m here for it. I love a multi-use product that can do everything. Act as a lipstick , shadow and blush. Crease proof, smudge proof and fool proof! From graphic liners , to blush  to lip tints and lipstick. This is it ! \n\nFollow me @_djeneba on Instagram for more DMB recommendations.",
    "time": "2021-09-24T20:24:23.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "Rachelrosem",
    "rating": 5,
    "recemonded": true,
    "title": "Longwear and flattering",
    "text": "The perfect universal pink, longwear, waterproof and can use it on eyes lips and cheeks!",
    "time": "2021-09-24T20:07:09.000+00:00",
    "age": "35to44",
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "Lecookie",
    "rating": 5,
    "recemonded": true,
    "title": "The possibilities are endless!",
    "text": "The possibilities are endless with this product! I use this on my eyes, lips and cheeks! It is so creamy, pigmented and light weight. It never creases and there are so many beautiful, vivid shades. I am never disappointed by Danessa Myricks products!",
    "time": "2021-09-24T19:46:23.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "kelseyhbeauty1",
    "rating": 5,
    "recemonded": true,
    "title": "lift is a must have have",
    "text": "I love lift to use to mix into other colours to create your own lighter shade or use as a shadow base to make your eyeshadow last longer and pop! Must have !",
    "time": "2021-09-24T19:45:09.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "mcatmom",
    "rating": 1,
    "recemonded": false,
    "title": "Wanted to love it, so much hype!",
    "text": "Unfortunately this product didn’t work for me at all.  Sticky, doesn’t dry down.",
    "time": "2021-09-21T22:49:45.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "blessedandmixed",
    "rating": 1,
    "recemonded": false,
    "title": "very faulty",
    "text": "I really wanted to love this picture until the top of the item dried and exploded in my car. The color was nice but I’m not happy about the car detail payment I have to make. The top the top of the item is faulty and broke off as well and should be changed. It exploded everywhere including on my son hair face and clothing. The product is a bit drying and the stains are extremely difficult to get off. I have to say this has never happened to me and I’m extremely disappointed",
    "time": "2021-09-15T12:38:39.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "sweetscarlett16",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "Rebirth is such a beautiful color! The shine is so beautifu.",
    "time": "2021-09-09T23:00:35.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "sasazz",
    "rating": 2,
    "recemonded": false,
    "title": "Meh",
    "text": "Purple and too light for my skin tone. Also looks weirdly chalky when applied. Doesn’t smear after it dries though",
    "time": "2021-09-09T17:56:05.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "RetroMellyB",
    "rating": 5,
    "recemonded": true,
    "title": "Found this brand through Instagram!",
    "text": "The hype is real and Danessa Myricks Beauty Cream Pigment isn’t getting enough credit! Once blended in, the matte is a beautiful finish.  As far as being able to remove it, I had no issues removing the product. I used the Neutrogena makeup remover wipes and it came right off! I bought the black matte and I can’t wait to try the other colors!  I suggest buying the brush that Sephora recommends to get the perfect application.",
    "time": "2021-09-04T05:13:17.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "claremarie",
    "rating": 4,
    "recemonded": true,
    "title": null,
    "text": "Holey disco ball eyes! I didn't realize what foil meant, but I like the glitter effect. This is a fun product!",
    "time": "2021-08-31T14:06:15.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "jeanner",
    "rating": 5,
    "recemonded": true,
    "title": "Beautiful blush with amazing staying power!",
    "text": "This is a wonderful product with amazing staying power. It is heavily pigmented and I originally bought the rose and it was way too dark for my light olive skin. I exchanged it for the latte and it’s much better for me and I am going to buy the lighter pink as well. Application is key and you only need a very very small amount and I dab it on to my cheeks with a sponge. I have never used a blush that actually stays on all day.",
    "time": "2021-08-21T20:19:36.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "startovr",
    "rating": 3,
    "recemonded": true,
    "title": null,
    "text": "The pigment was great and the staying power was also lovely. Unfortunately there was a bit too much glitter fall out. It was not manageable. It also looked a lot more silver than beige, so much so that I thought I was sent the wrong color at first. I love another one of her shades, just not this one. I think I just found a dud.",
    "time": "2021-08-10T03:55:31.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "AmberMarie8",
    "rating": 5,
    "recemonded": true,
    "title": "HG Product",
    "text": "I just recently wrote a review on the color \"Romance\" and my thoughts still hold true for the shade \"Celebration\" (pictured below) as well as \"Céme Brulee\". They're all beautifully pigmented. The longevity of this formula absolutely amazes me! I can wear them on my eyes for 12+ hours without creasing, fading, or becoming gunky. (you know what I mean) I love the pinkier shades for my cheeks and lips too. They blend out seamlessly on the cheeks and just melt into my lips. This product is so versatile! I highly recommend you go check it out and find a shade/finish that you like and give it a try! You won't be disappointed!",
    "time": "2021-08-09T04:33:40.000+00:00",
    "age": "35to44",
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "Purpleishco",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "I didn’t know what to expect but I am very satisfied!",
    "time": "2021-08-02T08:44:51.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "muanai",
    "rating": 5,
    "recemonded": true,
    "title": "best multi product",
    "text": "I live in Ontario Canada I order this product Desert Rose and Venus. Both products came with in 1-2 weeks! I used them as eyeshadow, highlight, blush and lipstick. They work amazing and blends easily into my looks. It’s also fitting on my darker complexion. I would recommend for other makeup artist. The size is small and mattes quickly but the product quality is worth it.",
    "time": "2021-08-01T18:46:30.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "KAM007",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "I have this in the shade Milky Way. It is without a doubt the sparkliest eye shadow I’ve ever used. Absolutely beautiful if that’s what you are looking for. Dries down completely and does not budge.",
    "time": "2021-07-31T19:05:01.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "niccoletta",
    "rating": 1,
    "recemonded": false,
    "title": "good colour, rubbish longevity",
    "text": "comes right off.  pretty colour, but not anywhere even in the zip code of long-lasting.  i am not a fan of rampant unchecked colour transfer.",
    "time": "2021-07-28T17:45:52.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "AmberMarie8",
    "rating": 5,
    "recemonded": true,
    "title": "AMAZING!!",
    "text": "Beautifully pigmented, blends effortlessly, no creasing and no fall-out! This formula is absolutely amazing! It lasted all day long. Just a little bit goes a long way, so you're getting plenty of product for a really great price! I can't wait to purchase more colors!!",
    "time": "2021-07-26T23:07:34.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "JaysFace",
    "rating": 5,
    "recemonded": true,
    "title": "Perfect Pink!",
    "text": "i absolutely love this product. The pigmentation is incredible and it the perfect pink I've been searching for.",
    "time": "2021-07-18T13:05:07.000+00:00",
    "age": "over54",
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "awholbert",
    "rating": 1,
    "recemonded": false,
    "title": null,
    "text": "Horrible. As soon as this touches your skin, it’s stuck and will not blend out.",
    "time": "2021-07-17T03:12:36.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "stephroll2",
    "rating": 5,
    "recemonded": true,
    "title": "must buy",
    "text": "Some of the best multiuse product. I’m in love with this brand and the product. Literally use a small dot and it’s enough for your eyes and cheeks. I love this for days I’m in a rush.",
    "time": "2021-07-13T08:52:12.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "Kreb107",
    "rating": 5,
    "recemonded": true,
    "title": "Recommend!",
    "text": "Love the way this goes on, doesn’t dry too fast so it’s blend able. Nice light shimmer",
    "time": "2021-07-13T00:06:13.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "fanson",
    "rating": 3,
    "recemonded": true,
    "title": "Careful with the reds",
    "text": "I was head over heels for this product upon first use. But as the day went on it started to bleed into the corners of my eyes as well as bottom las line. Not waterproof,  not in Arizona heat anyway. And then it left pink dye all around my eyes for DAYS after. I looked like I had an infection. Be very careful with the red and berry tones when using on the eyes or as eyeliner. I am trying out some of the less Intense shades and hope to have a better result. Genius product idea, maybe it’s just the reds that are a no go",
    "time": "2021-07-06T15:30:13.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "bekclynn",
    "rating": 5,
    "recemonded": true,
    "title": "Lasts more than 24 hours!",
    "text": "I love the trueness of the colors.  They stay put and show zero fade even after 24 hours, and I’m talking about while camping!  A bit tricky to remove and takes some patience and oil cleanser but I’ll take the long lasting eye color even with a little work for removal.  I have read several posts about the product drying out and I have not had that issue with the 6 colors I have.  The creams are not long lasting though and should be listed as a separate product.",
    "time": "2021-06-30T20:27:11.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "seema2321",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "I mainly got this for wet look but didn’t realize i good or a lipgloss this is!",
    "time": "2021-06-29T03:27:10.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "nickikristy",
    "rating": 5,
    "recemonded": true,
    "title": "Obsessed!",
    "text": "I absolutely adore this for use on my lips and cheeks. Unlike the matte versions, this doesn't dry down and set, so it's very easy to work with and easy to blend on my cheeks. It's the perfect level of glossiness, a nice sheen without looking too shiny, and opaque while also being easy to blend. I like to use one of the matte colors on my lips, let it set, and then apply this over it.",
    "time": "2021-06-28T03:18:47.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "iScottieC",
    "rating": 5,
    "recemonded": true,
    "title": "Golden Goddess in Kit-Friendly Packaging",
    "text": "This product is amazing as it comes in many colors and mixes well with other cream and liquid products. This particular shade is perfect for deeper toned people looking to add a golden glow. When used to highlight under Temptu S/B Airbrush Foundation, it provided a very luminous “glow from within” and did not move. I was so impressed when it played well with the Master Mattes: Pro Lip to make a long-wearing lip color that didn’t budge for hours... despite the Jamaican heat, the bride’s first kiss, many drinks, and ultimately a nighttime swim. This is a kit essential for those looking to downsize their kit due to its many uses. Layer with Danessa Myrick’s Light Work 2: Highlighting Palette for a multidimensional metallic finish.",
    "time": "2021-06-23T15:42:23.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "iScottieC",
    "rating": 5,
    "recemonded": true,
    "title": "Dreamy! Magical! Kit Essential!",
    "text": "This product is amazing. Comes in many colors and mixes well with other cream and liquid products. When used to highlight under Temptu S/B Airbrush Foundation, it provided a very luminous “glow from within” and did not move. I was so impressed when it played well with the Master Mattes: Pro Lip to make a long-wearing lip color that didn’t budge for hours... despite the Jamaican heat, the bride’s first kiss, many drinks, and ultimately a nighttime swim. This is a kit essential for those looking to downsize their kit due to its many uses.",
    "time": "2021-06-23T14:48:10.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "nikkicharlie",
    "rating": 4,
    "recemonded": true,
    "title": "Check it out!",
    "text": "Love this so much! Highly recommend. Only con is at the end of the day, if not applied correctly, the color starts to slightly fade so apply a generous amount!",
    "time": "2021-06-21T13:28:45.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "genart",
    "rating": 5,
    "recemonded": true,
    "title": "worth it!",
    "text": "The colorfix last a long time. No matter if it’s matte or foil! The nude glazes are my go-to look for an added dewy complexion. There are a good shade of browns and nudes for everyone so you’ll guarantee find your match. It also glides on beautifully and I’m obsessed with DMB.",
    "time": "2021-06-18T16:07:41.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "Poopface2",
    "rating": 1,
    "recemonded": false,
    "title": "Messy, hard to work with, waste of money",
    "text": "This product is garbage. It is EXTREMELY difficult to work with. It dries very fast and unevenly. Even worse, the product was damaged; there was a clog in the tube and when I went to dispense, the applicator tip went flying off. Then I got to spend the next 30min cleaning up pink glitter goo from my carpet, shoes and clothes. It was also VERY difficult to clean up. Not only would I not recommend, I want my money back.",
    "time": "2021-06-16T20:37:24.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "chloest",
    "rating": 5,
    "recemonded": true,
    "title": "AMAZING",
    "text": "LOVE this product, this color, as well as any other Danessa Myricks products! She never misses the mark. I love this as a cream blush or mixed into some chapstick for a light lip flush.",
    "time": "2021-06-06T17:17:29.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "abbyhegs",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "I love this product! The shade ‘chocolate’ works as such a beautiful/unique eyeliner color\nPigment was easy to work with and opaque!",
    "time": "2021-06-05T00:20:50.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "amybianca79",
    "rating": 5,
    "recemonded": true,
    "title": "Wow!",
    "text": "This is so much better than I thought it would be. I have old crepey eyes, dry skin and I thought this would enhance the crepey texture of my eyelid. It does NOT, at all! It looks beautiful on, wears beautifully and is so easy to use. I’m glad I took a chance on these (I also bought goldmine), I will definitely buy more. These things are perfection!",
    "time": "2021-05-22T21:58:17.000+00:00",
    "age": "25to34",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "sjcinca",
    "rating": 3,
    "recemonded": true,
    "title": null,
    "text": "I wanted to absolutely fall in love with this, but found it more difficult to work with than other products that are supposed to be multi purpose like this. \n\nPros: great pigmentation that you could easily build up, or sheer out (requires more effort, and potentially skill). The latte color is gorgeous, and flattering for a lot of skin tones and depths. \nCons: it dries too quick to work with, and is unforgiving. I had to redo my makeup the first time I used it. The formula is matte, but was somehow slightly tacky after it dried on my cheeks. \n\nOverall I love the concept of this product, and the monochromatic looks you can achieve, and will continue to play around with it!",
    "time": "2021-05-17T07:28:57.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Jennijanks17",
    "rating": 5,
    "recemonded": true,
    "title": "Amazing Color! No Transfer",
    "text": "In seconds of applying these matte colors set and have no transfer. I’ve eaten entire lunches and my lip color was left in tact. I am in love and will be purchasing more matte colors with the next big sales event in November! I love these small pancakes with their powerful punch of color and long wear coverage! Myricks is a genius",
    "time": "2021-05-16T12:05:05.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "EmBrodsky",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "Absolutely love this product! I bought the wrong shade but ended up still loving it! Defs will be buying more colors!",
    "time": "2021-05-13T23:59:10.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "startovr",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "I haven’t used this as a cheek or a lip pigment but it is 100% worth it even if you only use it as an eye shadow. Seriously perfect. Pigment is great. Easy to blend. Dries down and stays all day. I haven’t had any issues with shimmer fall out. I do one eye at a time bc this dries down quickly. Great for one-shadow eye looks. No one paid me to write this but someone should haha",
    "time": "2021-05-11T04:56:29.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "sprout8080",
    "rating": 5,
    "recemonded": true,
    "title": "Winning shadow!",
    "text": "Loving this after several uses. I have oily lids and issues with eyeshadows creasing, but this one stayed put all day. It goes on smoothly, dries quickly, blends easily and is buildable. Exposed is a great colour on my fair skin for every day wear with little muss. Now I just need to choose more colours!",
    "time": "2021-05-09T23:37:38.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "candyangel420",
    "rating": 2,
    "recemonded": false,
    "title": null,
    "text": "The metallic was nothing like the matte. It went on patchy, it wouldn’t blend, it was very frustrating. I’m holding onto it to try and keep working, but my hopes are low.",
    "time": "2021-05-09T13:38:57.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "NeiaB",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "I purchased this during the Sephora sale. This is one of the best formulas.  I must get more!! It did not move and lasted all day. This is a MUST!!",
    "time": "2021-05-07T03:52:19.000+00:00",
    "age": "over54",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "DeeInDenver",
    "rating": 4,
    "recemonded": true,
    "title": null,
    "text": "Beautiful for a inner corner highlight! I do have to set the product if I use it on my eyelid.",
    "time": "2021-05-06T16:50:50.000+00:00",
    "age": "over54",
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "smooney",
    "rating": 4,
    "recemonded": true,
    "title": "Very pretty! Can’t really be worn alone though",
    "text": "The color Titanium in real life looks exactly like the pictures on here! It is really stunning in person, partially because it’s more sparkly and less of a true metallic - there are discernible glitter particles in there but it goes on the eye completely smooth. I’m happy with the lasting power, however I didn’t like how this blended out with a fluffy brush, because it sends sparkles everywhere all over the eye. I need to try blending out with a finger but that’s not my preferred method. \n\nI will say, if you’re looking for something similar to the Charlotte Tilbury pots, this is NOT like that. It’s more liquidy and definitely a “foil” as described and not like a metallic. So keep that in mind!\n\nAdditionally, this isn’t something I would wear by itself because it’s a big too full-on not to have something more matte and deeper to “ground” it.",
    "time": "2021-05-06T01:59:49.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "Halama",
    "rating": 5,
    "recemonded": true,
    "title": "SO SO SOOOOO GOOOOOD!!!",
    "text": "This is amazing. Super pigmented and blends beautifully. The color Exposed is perfect for bronzing/contouring. I will definitely be purchasing more colors.",
    "time": "2021-05-06T00:01:31.000+00:00",
    "age": "35to44",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "redhair911",
    "rating": 5,
    "recemonded": true,
    "title": "Nice formula too dark.",
    "text": "Nice product, very pigmented. Very. This color is too purple and dark for my coloring.",
    "time": "2021-05-05T14:10:43.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Mariamei",
    "rating": 5,
    "recemonded": true,
    "title": "Versatile use",
    "text": "First time trying this product and best thing I did \nIt’s so versatile and easy to work with blend so well and last all day .",
    "time": "2021-05-05T12:46:17.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Ispend2much6",
    "rating": 5,
    "recemonded": true,
    "title": "Wow!",
    "text": "I can't think of another product that will give you more bang for your buck- $18 for this tube that will probably last for months.  The shades are simply gorgeous!  This shade was very comfortable on the lips, and very smoothing- it did not accentuate any lip lines.  I'll be buying more.\nIn the picture below, the shades are Wild Orchid, Latte, and Macaron. The swatches are Latte on the left, Macaron on the right.",
    "time": "2021-05-05T02:43:45.000+00:00",
    "age": "35to44",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Kimmybella",
    "rating": 5,
    "recemonded": true,
    "title": "Lips look better than usual",
    "text": "I love this so much, gorgeous color for my cheeks and lips! It made my lips look better somehow and the color really complements my skin tone",
    "time": "2021-05-05T00:06:20.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "divadivine",
    "rating": 5,
    "recemonded": true,
    "title": "Amazing",
    "text": "I don't think I can say enough good things about the Colorfix Pigments.  They are not lacking in color.  They layer well with each other and with other brands of cream based shadows.  The finish isn't cakey.  Most importantly, a little goes a LOOOOOONG way.  You can apply them with your finger or a brush.  If you use a brush, just make sure to clean it right after or the bristles can get stiff.  You do get some time to actually blend the pigment but once it dries, it's not budging.",
    "time": "2021-05-04T23:30:13.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "ObsessedLippy",
    "rating": 5,
    "recemonded": true,
    "title": "First Class",
    "text": "I knew about this brand before it came to Sephora.  I even purchased things from her website directly.\n\nAll the products I own from this brand are used constantly.  I like a product that is usable for many purposes.  All the Creams fit the Bill.\n\nSometimes in a rush I don't even bother with a lip pencil.  I just take me finger swipe this over my lips and out the door.  \n\nThey make for great eyeshadows, cheek color or even highlighter.\n\nI can't wait to see what she produces. next.",
    "time": "2021-05-04T22:36:58.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "pisces32",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "Absolutely Beautiful I own 2 colors and I want them all so beautiful long lasting color!!",
    "time": "2021-05-04T20:29:00.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "peaceandloveca",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "WOW.  CHOCOLATE!   THIS COLOR IS B.E.A.U.T.I.F.U.L!  It is a beautiful deep dark burgundy wine color vs the actual color of chocolate.   Think of it as a vampy dark burgundy color. This tube will last FOREVER!  I use very little on the corner of my eyelid as an accent and all I need is a tiny bit, like a size of an nant!  I put just a dot on my lips and it was GORGEOUS!   It is really pigmented and although it is matte, it is not drying.  It is very opaque.  On the lips it is staining and works nice with gloss.  It's a great winter color.  I am a light medium tan color with black hair if this helps anyone.",
    "time": "2021-05-04T06:34:01.000+00:00",
    "age": "over54",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Susan93",
    "rating": 1,
    "recemonded": false,
    "title": null,
    "text": "Overhyped and not sure why. I got two colors and I’m extremely disappointed in them. I tried to use magnetic as an eyeliner since the color is gorgeous. But it kept transferring and I had fall out which was strange. I tried using it on its own as a cream shadow and it kept on creasing. I tried many different ways to make this work and it wouldn’t. I used eyeshadow primer, set the primer with powder, set the wing with powder, didn’t layer the wing (color wasn’t as pigmented). I don’t have oily lids and never experience creasing unless I’ve been outside for a couple hours in the heat. I never left the house when I was testing this product out.",
    "time": "2021-05-04T06:01:48.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "MarilynDMakeup",
    "rating": 4,
    "recemonded": true,
    "title": "Chocolate is not neutral more very deep burgundy",
    "text": "I am happy with the texture. When working with thicker layers the colour is closer to brown BUT if you use thin layer or when blending to diffuse the colour... be ready to see burgundy. This colour is not a neutral deep brown. It’s more like a very deep burgundy the red undertone is strong in this pigment. I am only giving 4 stars because there was no colour specification on the website mentionning this important details. The images are showing more of a neutral brown. My rating has nothing to do with the formula of this product. I am exited to finally add Danessa Myricks in my pro makeup kit. I didn’t have the chance to used them a lot to give a better feedback. NOTE, if you are a colour mixer : get a light colour like white. If I knew dessert was a darker shade of latte I would have got a white to create(mix) it instead of getting 2 colours that are that so closed. It would give you more possibility that way!",
    "time": "2021-05-03T16:54:53.000+00:00",
    "age": "25to34",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Angelreverse",
    "rating": 5,
    "recemonded": true,
    "title": "SOLD!",
    "text": "I give this product full points. It is super pigmented and goes on pretty smoothly. I used my fingers and a brush the second time. I preferred application with the finger since it was much faster and went on pretty tight. It had a Matt finish and did not crease. Weirdly enough it didn’t transfer either and stayed in place even without a primer. I’m pretty sure this is going to be a staple on my vanity forever.",
    "time": "2021-05-02T03:54:34.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "beauty2212",
    "rating": 3,
    "recemonded": true,
    "title": "Pretty but not long lasting",
    "text": "I like the color and it is really easy to use, but it is not long lasting at all. At the end of an 8h shift it is no longer on my eyes and I set it with eyeshadow or bronzer. I will continue to enjoy it but don't know if I would buy more of this finish.",
    "time": "2021-04-30T12:21:26.000+00:00",
    "age": "25to34",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Seema82",
    "rating": 5,
    "recemonded": true,
    "title": "truly impressive product!",
    "text": "I purchased eight of these during the VIB sale. These are as excellent as the rest of the raving reviews say they are! Although these are not a new concept what I really love about these is that they dry down  in the same shade as what they appear as. I find for me personally that although they are pigmented I definitely don’t have enough when I used one tiny dot. I probably have to use two or three dots for opaque coverage. Also I completely disagree with some of the reviews that say that these dry down very quickly. Once you lay it down on your face you have a good 20 or 30 seconds to work with before they start drying down. However I suppose if you are only using one drop for a sheer wash of colour it will take less time to dry but it still wasn’t a problem for me personally. I was able to spread it to where I needed it to go. Make sure your Is is on tight because that will cause the issues that other people have that it dries out. Also if you like these there are so many more shades on her website!",
    "time": "2021-04-30T07:04:17.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "SheGlowsPale",
    "rating": 5,
    "recemonded": true,
    "title": "I feel pretty..",
    "text": "I own three of these - ballerina, romance, and goldmine. I’m also excited to try Alien when it’s back in stock. These are awesome and versatile. Ballerina is my far my favorite. Its a light sheer pink, and I love it as an eyeshadow wash and a highlighter. It does have micro shimmer, but I don’t know what type shimmer danessa myricks uses in this but it’s basically magical..it’s obviously shimmer, which I usually stay away from especially in highlighters (I prefer pearlized over actual shimmer particles) but like I said it’s just this magical micro shimmer that just makes me feel so pretty without feeling like a 12 year old throwing glitter on her cheek. It’s like grown up fairy shimmer lol\nAs far as the other two colors - Romance is kind of like a darker version of ballerina but pearlized instead of actual shimmer particles., it actually makes a pretty blush. And goldmine - really pigmented shimmery gold, very pretty, and very pigmented! But it’s SLIGHTLY olive toned which I don’t love in my gold makeup, I prefer a yellow/bronzey gold but still a great formula just not the right color for me.\n\nThese stay put as soon as they dry down, better then any other liquid eyeshadow I’ve tried. But work fast!",
    "time": "2021-04-30T03:58:50.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "LCothren",
    "rating": 4,
    "recemonded": true,
    "title": "Clear, natural cheek colour",
    "text": "I initially didn't like this but I've come to appreciate what it does.  Used as a blush, it lasts quite a long time and gives a clear, natural-looking colour. On the lips it doesn't last long, I find, but that's rue of all glosses.  I do like that you can match lip and cheek colours.  I've ordered a couple of eye shadow colours and I'm eager to see how they turn out.  The price is unbeatable, too",
    "time": "2021-04-28T21:09:35.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "scout2u",
    "rating": 2,
    "recemonded": false,
    "title": "Pretty, But Sticky & Wet",
    "text": "I have the matte formula of this in Creme Brulee. i use a TINY dot of it on my cheeks under powder blush. You have to blend it very fast or it sets in a spot. I was hoping this would be similar. I am looking for an easy product to slap a light layer of sparkle on my eyes and go. This is pretty. It has a sparkle base and holographic glitter. However, it is wet and sticky. It does not dry down. I tried it over my regular 24 hr shadow base and it was still wet and sticky. The glitter also falls out all over. My face looked like a disco ball in under 30 minutes. Not good for contact wearers. I could see this being pretty as a highlighter on cheekbones for a special occasion, but that is not what I wanted so back it goes.",
    "time": "2021-04-27T22:10:50.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Kyleyak",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "This is so so beautiful and easy to use. It pretty much does the work for you. It’s a great one and done eye look and It dries down, doesn’t crease, and I haven’t noticed any wear-in or wear-off. I love it and definitely recommend it.",
    "time": "2021-04-27T19:25:14.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "momoftwo99",
    "rating": 5,
    "recemonded": true,
    "title": "Impressive product.",
    "text": "I purchased Desert Rose because I was looking for an all purpose product. I use the tiniest dot amount for each eye, lips, and cheeks because it is very pigmented. It’s blends out easily and looks amazing as an eyeshadow, blush, and lip colour using only my finger. I do use a lip balm underneath on my lips for extra hydration. For ref: NC40 sensitive skin with eczema and dry patches. It did not irritate my skin. It’s a small tube but you only need the tiniest amount so this tube will last a very very long time. Impressive product!",
    "time": "2021-04-26T23:56:46.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "LoveCirice",
    "rating": 3,
    "recemonded": false,
    "title": "Color did not last",
    "text": "The color was super pretty when it first went on, but after a couple of hours the pink color wore away and I was just left with silver glitter all over my eye. It did crease a tiny bit but I have slightly hooded eyes so that is to be expected.",
    "time": "2021-04-25T20:47:55.000+00:00",
    "age": "25to34",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "dkitty1",
    "rating": 5,
    "recemonded": true,
    "title": "amazing",
    "text": "This has great pigment! I used the cream and then applied the clear gloss over it. I love it! The gloss makes it super shiny.",
    "time": "2021-04-25T15:24:09.000+00:00",
    "age": "35to44",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Tracy10s",
    "rating": 5,
    "recemonded": true,
    "title": "Impressive",
    "text": "This product is phenomenal. I can’t imagine how long this will last because it’s so highly pigmented. Like a tiny pin drop will give you more than enough for both eyes. There’s a bit of a learning curve, but once you play with it, you’ll be blown away. I’m 46 & what worked for me in my 20’s & 30’s doesn’t work now. Cream products are my new go-to’s. I’ve purchased 2 of these so far & have a feeling I’m just getting started.  For the price point & quality, this cannot be beat.",
    "time": "2021-04-24T17:55:43.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "marierichard",
    "rating": 3,
    "recemonded": true,
    "title": "Chocolate is more burgundy",
    "text": "Love the product, great color payoff and only slight creasing at the end of a long day, but I'm unsure if I received the right color? It says chocolate on the package and product, but is most definitely not a chocolate brown. More of a burgundy. It's still lovely but I wish I would have gotten the right color.",
    "time": "2021-04-24T01:52:07.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "RoxanneY",
    "rating": 5,
    "recemonded": true,
    "title": "Very Versatile",
    "text": "Beautiful all around product to use on eyes, cheeks and lips!",
    "time": "2021-04-23T14:05:28.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "brieone",
    "rating": 4,
    "recemonded": true,
    "title": null,
    "text": "This is a lovely product. I have known of Danessa Myricks for years in the makeup community, even had a chance to attend one of her classes at a hair show. The idea of an affordable, versatile eye, cheek and lip pigment is very on trend especially with the “my skin but better” trend.  One star off because the colors in the tube and swatches are not true. Chocolate and Desert Rose are much more red than brown.",
    "time": "2021-04-23T13:11:58.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "nikkimaria",
    "rating": 5,
    "recemonded": true,
    "title": "Latte Sweet Pink ❤️",
    "text": "This is an awesome product! Love that I can use it on my eyes lips and cheek! Very monochromatic look! \nThis is the only matte that I have from her and I will be buying more. I prefer the mattes to the sparkle ones in this line. Long lasting great quality",
    "time": "2021-04-22T18:43:46.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "discowitch",
    "rating": 5,
    "recemonded": true,
    "title": "HOLY MOLY!",
    "text": "This stuff is just...amazing. The color Titanium has some teal reflect to it which I wasn't expecting (thought it was gonna be straight up silver), but is totally welcome. One tiny dab will do, but I couldn't help but apply more than just that BECAUSE IT'S SO SPARKLY. Stuck on my lids (with primer) just fine for several hours until I removed it. (I still have a swatch on my hand, even after several washes!) Not sure how I'd use it besides on my eyes, but could make for a neat lipstick topper. SO much bang for your bucks with this product. Excited to try the other color I purchased, \"Rocket\"!",
    "time": "2021-04-22T03:35:52.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "tttay",
    "rating": 5,
    "recemonded": true,
    "title": "STUNNING",
    "text": "QUEEN Danessa Myricks. I absolutely love this. It goes on very well and doesn't crease and lasts all day. I love the idea of eyeshadow but always have a hard time finding the right shade of eyeshadow for me to not make me look like a crazy person. This is it. It's light enough that I can add it to my daily look. \n\nThe only con is the packaging, the product squeezes out of the tube without any pressure, causing it to get messy.",
    "time": "2021-04-21T15:31:02.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "QuadaMeg",
    "rating": 5,
    "recemonded": true,
    "title": "SO GOOD!",
    "text": "I was very hesitant in trying this product, but wow I am blown away! Strong pigment but easily blended out. All I did for my look was apply the Colorfix, blend out, and add a glittery shade on the lid. Definitely getting in more colors!",
    "time": "2021-04-21T13:05:00.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "tikotiko",
    "rating": 5,
    "recemonded": true,
    "title": "Ballerina",
    "text": "Ok people    this is a great shade    the prettiest pink I have ever seen  I'm in love with this one    this is   my 2nd shade from her collection   it's  beautiful chrome soft pink  smooth doesn't crease   it's just such a pretty shade not your typical shade of pink    so happy I chose this color",
    "time": "2021-04-20T15:19:59.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "true"
  },
  {
    "name": "ShiyuD",
    "rating": 5,
    "recemonded": true,
    "title": "Deserves the 5 stars!",
    "text": "I can see why this is an award winner. I can't wait to try other colors. The color is as shown but seems a little darker when you put it on unless you spread it very thin. I only needed a drop the size of a pin head for each eye.The staying power is incredible and easily lasts all day with no smudging, smearing or wear. It blends easily with the ABH powder eye shadow I use along with it.",
    "time": "2021-04-20T00:47:45.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "panicmedusa",
    "rating": 2,
    "recemonded": false,
    "title": "pretty glitter but it's pure glitter",
    "text": "This shade is gorgeous don't get me wrong. If you wear and love glitter around your eyes you will love this. It has good staying power and has little fallout once dry. However I am really over glitter especially in eye products with no eye area disclaimer. I'm a contact wearer and this did not mix well with them. It's a shame because I really do love the mattes and wanted to be able to use the foil and metallics.",
    "time": "2021-04-19T17:49:29.000+00:00",
    "age": "25to34",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "SISIWHO",
    "rating": 5,
    "recemonded": true,
    "title": "Amazing",
    "text": "I love this pigment. I’ve been looking for the right colour of red to use as eyeshadow and Ive finally found it!!!! I’m going to buy other shades",
    "time": "2021-04-19T16:13:40.000+00:00",
    "age": null,
    "sephora_staff": "true",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "girlgvng",
    "rating": 5,
    "recemonded": true,
    "title": "the only product you’ll ever need!",
    "text": "This is by far the best cream product I have ever used.  I have been using DMB products since before they launched in Sephora & have been in love ever since.  Don’t listen to the reviews that are only giving it a lower rating because it dries too fast or it’s too hard to blend... It’s a waterproof product- therefore you must work quickly in small areas at a time... & please...if you’re not accustomed to this kind of product, don’t squirt the tube directly on your face.  Work from your hands or a palette.  You WILL experience issues with this product if you use too much or if you work too slow.  I use a rice grain amount for both eyes & blend with a brush, starting with most of the pigment on the lid & blend while using short, downward strokes for a smokey look. It lasts all day, even as a eyeshadow base.  I urge you to check out Danessa’s IG or DMB university if you need inspiration or a tutorial.  I’m so overjoyed to finally see these products in Sephora!",
    "time": "2021-04-19T15:41:26.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "lilmew",
    "rating": 5,
    "recemonded": true,
    "title": "worth it!",
    "text": "This line is the definition of everything I love in makeup. It’s just so ridiculously useful in a multitude of ways. I got multiple shades and love them all, but I really wanted to take note of this clear gloss. As much as I love the glossy lid look, I never bought any lid gloss because I just didn’t see it as actually being wearable, wearable in the sense that I mean I thought it’d just be a creasy slide-y mess. This really wasn’t the case! I wore this on top of exposed in particular, and it actually wore really really well. Not sure how it’s work on top of powder, but it works beautifully on top of her other shades! Also used it as a highlight topper, and that’s a move.",
    "time": "2021-04-18T15:58:44.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "megbrownie24",
    "rating": 5,
    "recemonded": true,
    "title": "Glitter!",
    "text": "This shade is more pure glitter with some pigment, a little harder to work with than the regular metallics but so beautiful I can’t dock a star. So sparkly! And stays in place!",
    "time": "2021-04-18T04:08:18.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "slub2003",
    "rating": 2,
    "recemonded": false,
    "title": "Glitter",
    "text": "Unfortunately I don't like the shimmers. They are very glittery. Maybe mats are better.",
    "time": "2021-04-17T14:09:59.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "JennsBeautyRoom",
    "rating": 5,
    "recemonded": true,
    "title": "One & Done 11 Hour Shadow!",
    "text": "Was so impressed that the shade \"Rocket\" lasted 11+ hours on my oily lids. A little goes a long way, so this tube will last me for ages. It does dry down very quickly, so I had to work fast, but for a one and done eye shadow I really can't complain. Already picked up more shades.",
    "time": "2021-04-17T03:24:15.000+00:00",
    "age": "25to34",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "MaddyJ8",
    "rating": 5,
    "recemonded": true,
    "title": "Excellent gloss",
    "text": "This is the best gloss I have ever tried, I will be using this all the time now! I have super sensitive skin and lips and so in the past the only lip product I can use without my lips getting eczema was fenty lip paint but the fenty lip paints are very bold and sometimes I just want a chill lip look. So I'm so glad I found this clear gloss because it's my new favorite product. I also purchased latte for my eyes and that one is a little harder for me to work with because I'm not very good with blending or moving fast. But I'm definitely going to buy more of the glosses I really hope more gloss colors come out.",
    "time": "2021-04-16T22:10:33.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Marjac1920",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "I have this in Nebulizer, Exposed, Chocolate, and Rustic and every color is amazing. It’s easy to apply and lasts all day long. My eyelids get oily and it doesn’t crease!",
    "time": "2021-04-16T21:52:41.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "Claufine",
    "rating": 1,
    "recemonded": false,
    "title": "disappointed",
    "text": "Sticky and difficult to blend on to skin. Weird product.\nI was disappointed after reading all the glowing reviews. Still can’t figure out the hype. I’ve tried to use it several times but it never seems to work. I think the issue is that it dries so fast.",
    "time": "2021-04-15T23:07:31.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Teashy",
    "rating": 5,
    "recemonded": true,
    "title": "Great wear and coverage",
    "text": "I love this! It was my first try with a cream shadow - its a nice golden yellow shade and dries matte (no streaks!) I can get away with only one coat for the coverage I want, and it wears all day no problem! I will definitely be buying more colours in this, and I hope they make a more neon yellow, because this is more of a golden/sunflower yellow.",
    "time": "2021-04-15T21:49:33.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "ElenaDm",
    "rating": 1,
    "recemonded": false,
    "title": "upset",
    "text": "I got so excited when I saw that this product finally arrived at Sephora ! I ordered it right away . As a makeup artist, I’ve never felt so weird and disappointed using the product. The colour is super intense for my light skin , also the formula doesn’t blend at all, no matter how fast I try to blend it . I tried to use it as a blush, but a tiny bit of product clogged my pores. Will be returning it",
    "time": "2021-04-14T23:27:53.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "slub2003",
    "rating": 3,
    "recemonded": false,
    "title": "If you like glitter",
    "text": "Nice duo chrome shade but way to glittery for me. It dries fast on the lids and has good staying power.",
    "time": "2021-04-14T17:31:33.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "HeatherInBoston",
    "rating": 2,
    "recemonded": false,
    "title": "Beyond gross",
    "text": "I don't know how this won an award. It's incredibly sticky and difficlult to blend. I tried it twice and ended up tossing it. Save your money.",
    "time": "2021-04-14T12:40:59.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "JG3000",
    "rating": 3,
    "recemonded": true,
    "title": "Pretty but tricky",
    "text": "Pretty and fairly easy to blend out, although quite tacky and pigmented. \nPros: if you blend fast enough and layer to get desired colour it does last all day and doesn't crease (with eye primer)\nCons: Tube seems to dry out and clump fast, even though brand new. So pigmented, you need to be careful bc once on...it's on!\n\nI also got the clear topper to make a wet eye look. Even with primer, I always get a terrible crease and goopy look in an hour...so no it's not crease proof, but it does look cool for a bit. I recommend using that one for gloss or maybe a wet highlighter (although this is sticky like gloss - so not on windy days)",
    "time": "2021-04-11T23:44:30.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "MKhamkhay",
    "rating": 3,
    "recemonded": true,
    "title": null,
    "text": "After reading such glowing reviews I had such high hopes and thought this would perform differently than all of the face/eye glosses on the market. I layered the gloss on top of another matte color fix pigment on my eyes. I unfortunately experienced the same things as I do with every gloss that ive tried; immediate transfer, tackiness, and only temporary dewiness. In the future I will stick to just using this as a highlighter.",
    "time": "2021-04-10T22:46:33.000+00:00",
    "age": null,
    "sephora_staff": "true",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "trishnaa",
    "rating": 5,
    "recemonded": true,
    "title": "creme de la creme",
    "text": "Hyped product for a reason. This has got to be the most perfect color selection & is so user-friendly. Blends like a dream!!",
    "time": "2021-04-10T21:58:24.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "Liz3541",
    "rating": 5,
    "recemonded": true,
    "title": "amazing",
    "text": "Amazing texture and staying power. Love the quality and color.",
    "time": "2021-04-10T20:20:19.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "gbaum",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "Holy lord. This has serious pigment and staying power! You do have to blend very quickly because after it sets, it’s not moving - never seen another product like this. Incredible.",
    "time": "2021-04-10T16:48:13.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "qwertysv",
    "rating": 1,
    "recemonded": false,
    "title": null,
    "text": "Definitely pigmented. Just not terrible useful on cheeks. When they say you only need a dab, believe them. The *tiniest* dot is unworkable on fair skin, unless you’re going for a clown-like appearance. Formula works a bit better on eyelids, but this particular shade makes me look like I’ve been rubbing my eyes.  Can see how this could work for creative folks with time to play, but if you’re looking for a quick solution for your morning routine, this isn’t it.",
    "time": "2021-04-10T10:03:37.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "scout2u",
    "rating": 4,
    "recemonded": true,
    "title": "Excellent For Adding A Flush To My Cheeks",
    "text": "One tiny, tiny dot adds a nice heathy flush to my cheeks. A really tiny dot or I look like a doll. I don’t find this useful on the lips. It wears unevenly and settles into the lines on my lips. I haven’t tried it as eyeshadow. Knocked off a star. If you don’t blend it FAST it ends up spotty and streaky.",
    "time": "2021-04-10T02:39:22.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "sexyabelincoln",
    "rating": 4,
    "recemonded": true,
    "title": "For lips it’s OK",
    "text": "Since the start of the pandemic I’ve been searching for a really bold red lipstick I can wear under a mask. This isn’t it (in primary red). It reminds me a lot in terms of feeling and longevity of the KVD liquid lipsticks. It needs to be blotted and it still transfers after that—not appropriate for mask wear. It’s almost as if it doesn’t completely set even after hours. Other than that it’s a perfect true red, does last a long time, and it is super pigmented. You only need a tiny amount for your whole lips—I imagine this would overall be very economical if you get a few primary colors and mix your own.",
    "time": "2021-04-09T22:23:06.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "barbieqsumm",
    "rating": 1,
    "recemonded": false,
    "title": "Dries out waaaaaaaay fast",
    "text": "I loved this product at first. It really is a great product. I was so excited about it that I bought almost all of the colors. Little did I know that most of them would dry out so fast. I’m very disappointed. They aren’t even usable. Such a waste of money.",
    "time": "2021-04-09T15:29:04.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "SparkleNshine34",
    "rating": 5,
    "recemonded": true,
    "title": "LOVE Love LOVE!!!",
    "text": "Absolutely beautiful! Easy to work with and buildable for a subtle wash or deeper pigment. I can’t wait to try more from this brand!!!",
    "time": "2021-04-08T20:37:07.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "ckbmom",
    "rating": 4,
    "recemonded": true,
    "title": "Great Neutral Color",
    "text": "Absolutely lovely - a great neutral color for my lips and eyes.  Much better than the foil, which would not go on evenly and just looked strange.",
    "time": "2021-04-08T01:04:11.000+00:00",
    "age": "45to54",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "ckbmom",
    "rating": 2,
    "recemonded": false,
    "title": "Disappointed",
    "text": "The color is on target but something is weird about the formula.  Does not go on evenly at all.  I will be returning it.",
    "time": "2021-04-08T01:02:51.000+00:00",
    "age": "45to54",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "JaninaJolie",
    "rating": 1,
    "recemonded": false,
    "title": "I Received “dried out” products. Never used.",
    "text": "Plastic Packaging is Defective! The color primary Yellow arrived to me completely dried out and after being sent another one, That one dried out in 2 months,  Along with 4 other shades. \n\nUnfortunately I invested  $300 in this product because of all the good things I heard.\n\n For and good example if you have any experience using MUFE Aqua xl color paints and Their Aqua brow paints . Those would last no less than 12 months plus...\n\nI’m really disappointed in how cheap and unreliable  the packaging is\n\nPlease fix the packaging.",
    "time": "2021-04-06T23:15:43.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "midnightwithme",
    "rating": 5,
    "recemonded": true,
    "title": "Super Pigmented",
    "text": "Wow! This product is super pigmented and stays on all day without creasing! I have exposed and celebration and definitely plan to buy more!",
    "time": "2021-04-06T09:56:04.000+00:00",
    "age": "over54",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "beautyholic90",
    "rating": 4,
    "recemonded": true,
    "title": null,
    "text": "It is good. In my opinion:\n- It is sticky (I think it's supposed to be sticky to have wet finish looking). It will never dry down completely. And will catch my hair (that's why I took 1 star off)\n- With makeup, it makes my skin look super good and healthy, even under the sunlight. \n- I don't like using it without makeup cause it doesn't cover anything.\n- Clear shade has no glitter. It goes give truly glass skin looking. I also use it as lip gloss.\n- I feel it has thick texture but it gives me no feeling on my face.\n- It doesn't ruin my foundation or lipstick or eye shadow.\n- I don't think it is waterproof 100%. But it does help a lot with sweat.\n- I find this one easier to use than Dew wet balm.",
    "time": "2021-04-05T21:01:10.000+00:00",
    "age": "25to34",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "PandaB003",
    "rating": 3,
    "recemonded": true,
    "title": "Ok...really not what I was hoping for.",
    "text": "On the fence about this one. I don't wear a lot of eye makeup. Want to purchase this a maybe a one and done loon. Dries really fast and \"Exposed\" looked really muddy on my tan skin. Maybe will try as a lip cream or blush. I can see why folks who are into makeup would like this product though.",
    "time": "2021-04-05T20:55:56.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "stephroll2",
    "rating": 5,
    "recemonded": true,
    "title": "best multi tasking product on the market",
    "text": "This product should be viral it is so good. The shade is a gorgeous pinky mauve and very pigmented. It’s matte yet it’s creamy, lightweight and easy to use. I definitely will be ordering more shades once the sale starts.",
    "time": "2021-04-05T20:04:53.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "GreatKate",
    "rating": 1,
    "recemonded": false,
    "title": "underwhelming",
    "text": "After this product flooded my Instagram Feed, I bought the Clear Glaze hoping to achieve the wet/glossy look. \n\nUnfortunately, it wasn't what I expected. It could be user error, but the glaze just wouldn't work. For my eyes, it was sticky and heavy, creased after minutes, and my mascara kept transferring. I tried with and without primer, but after only 2 hours of wear I had to take it off. For cheeks and lips, I wasn't blown away by the gloss it gave. I would recommend the line's Dew Wet Balm for a highlighting/gloss effect instead.",
    "time": "2021-04-05T17:24:50.000+00:00",
    "age": "over54",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Ketzzie",
    "rating": 4,
    "recemonded": true,
    "title": null,
    "text": "Nice but it’s too red to be called chocolate, the color is more like a burgundy.",
    "time": "2021-04-05T04:51:02.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "WendyHarris",
    "rating": 5,
    "recemonded": true,
    "title": "Hello pigment!",
    "text": "Just a pinch goes a long way!!!! Mixes well with other products like glosses for the lips. Used as eyeliner top lids....just wow! Comfortable nice matte finish but not drying.",
    "time": "2021-04-03T21:44:36.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "JaninaJolie",
    "rating": 1,
    "recemonded": false,
    "title": "Buyers beware! The plastic packaging is Defective!",
    "text": "Buyers beware!\n\nThe plastic packaging is Defective! cheap plastic Tubes That does not keep the product from drying out.",
    "time": "2021-04-02T01:20:24.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "LCothren",
    "rating": 2,
    "recemonded": false,
    "title": "It's lip gloss",
    "text": "The colours are pretty but it's not really appropriate for cheeks.  It's just a lip gloss, quite sticky and hard to apply on cheeks.  The colour doesn't last long, either. I'll use it up but I won't be buying it again.",
    "time": "2021-03-31T19:51:45.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Ippy",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "I have about 8 or 9 from this line now. It’s magic! Goes on smooth but blendable. And it stays on all day. Love mixing and adding glazes.",
    "time": "2021-03-31T01:00:29.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "kait46",
    "rating": 2,
    "recemonded": false,
    "title": null,
    "text": "Awful. So pigmented it’s hard to work with even with a tiny dab I got way too much colour and looked like a 5 year old who just slapped bright pink all over their face. It was really nice for the lips, ok for the eyes, but I bought it for the main blush aspect and hated it. You have .5 to blend in and i don’t even have dry skin I have oily so thought I’d appreciate the matte aspect but it was just NOT good. Will be returning",
    "time": "2021-03-31T00:10:28.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "FowlMari",
    "rating": 4,
    "recemonded": true,
    "title": "love it",
    "text": "Absolutely must have. It goes on silky and lasts forever. I use it as an eyeliner. It does take a learning curve. But overall worth it. I’m getting more colors",
    "time": "2021-03-30T07:07:42.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "meggy75",
    "rating": 1,
    "recemonded": false,
    "title": "nah",
    "text": "I was super excited about this but it’s impossible to spread when putting it on to cheeks or eyes, it comes gushing out of the tube and it’s very very messy. I’m bummed bc the color is pretty",
    "time": "2021-03-29T18:08:02.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "bobbymc",
    "rating": 4,
    "recemonded": true,
    "title": null,
    "text": "Purchased the clear glaze.  Love it.  Plan on trying the colors.",
    "time": "2021-03-28T23:06:37.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "verge",
    "rating": 1,
    "recemonded": false,
    "title": "Kaleidoscope, I don’t see it",
    "text": "I have a few of the other colors which I really like.  This color is a dud.  It is clear with a few specks of glitter hear and there.  I thought it would be more of a frost like, not clear glue with very few glitter speckles.",
    "time": "2021-03-28T15:18:22.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "kells77",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "I bought Creme Brûlée and black and love them both!  Creme Brûlée is great on eyes, cheeks and lips, and lasts a long time, and the black has a lot of used. I’m using it as eyeliner and it’s also great to use a small angled brush to fill in any white space on the top last line and to waterline. Danessa Myricks products are awesome.",
    "time": "2021-03-27T03:18:01.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "jaclynfoo",
    "rating": 4,
    "recemonded": true,
    "title": "Love Most and Dislike Some!",
    "text": "I bought 5 shades of Colorfix after being a huge Danessa fan and was finally excited to get to show the product! I got Exposed, Creme Brulee, Ballerina Chocolate and Milky Way. I love love the first three, the formula is creamy and wonderful. Stays all day and I put them straight into my kit! \nThe price is wonderful, no complaints there. It’s super versatile. \n\nHowever, Chocolate is actually not reaallly a chocolate shade IMO, it’s more a dark red, maroon. Which wasn’t what I was looking for. And Milky Way was the only foil one, I got, the consistency was much thinner than the others and I don’t know if I got a defective one but it separated on the lids, and did not stay on at all. It flaked all over my cheeks and I did not like it. I may try another foil formula again but I returned Chocolate and Milky Way. So I gave it a 4. \n\nTDLR; Mattes are great formula, Foil formula sucked for me, Chocolate isn’t a well represented shade name, overall a good price and stays well.",
    "time": "2021-03-26T19:45:09.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "karokaro",
    "rating": 5,
    "recemonded": true,
    "title": "Color me impressed",
    "text": "I bought two colors: Rocket and Goldmine, both foil/glitter. And I'm kind of blown away. The color payoff is intense, and very very little will go a long way. A dab the size of a sesame seed is enough for both eyelids, so you can use it very sparingly. \n\nStaying power is pretty good, but there was some creasing after a full day of wear and dance class. Not unreasonable.\n\nThe texture when dry reminds me of the ILIA liquid eyeshadows. ILIA has better staying power, but the colors end up much more muted and matte than you would expected once they dry down. The Colorfix pigments absolutely outperform ILIA on color intensity and lasting shimmer, and of course color selection, especially if you wanted a bolder look.\n\nI swatched them together for comparison. On the left are ILIA in Sheen and Colorfix in Goldmine, and ILIA in Dim and Colorfix in Rocket.\n\nI will definitely try more colors and look forward to trying out blending my own shades.",
    "time": "2021-03-26T16:36:04.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "karibe",
    "rating": 5,
    "recemonded": true,
    "title": "Winged Liner Game Changer!",
    "text": "I have been struggling to find a consistent black liner that would work as an eyeliner to line my eye and water line, as well as help me to effortlessly achieve a winged liner. I’ve tried gel liners, pencil liners and liquid liner. I fell in love with the Pat McGrath Labs liquid liner but I needed something that would stay put all day, especially because my inner corner waters throughout the day. I saw Blackout and thought... hmm, I wonder if it would also work as a liner. Let me tell you it is phenomenal! It’s perfect because I can apply it with a thin liner brush, so I have control over the application. It’s waterproof and doesn’t budge after drying down. It’s perfect for a sharp pointy inner corner and it actually stays put with my oily skin and watery water line. Obviously you can use it as a shadow for a smokey eye, to blend and darken other shades, and even to shape eyebrows! This product is such a game changer.",
    "time": "2021-03-25T21:43:54.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "jennrpeters",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "Stunning colour, doesn't budge. You just need a little on the eyelid and I also put a little bronzer in my crease, perfect easy look!",
    "time": "2021-03-21T15:25:40.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "ursamajor",
    "rating": 4,
    "recemonded": true,
    "title": "Versatile product",
    "text": "I have used Celebration as an eyeshadow, a wash of colour across my lips, and as a contour colour. It can be built up or buffed out and plays well with other products (eg clear gloss, powder eyeshadows, set foundation). My favourite way to use it is to tap a little bit of it into some cream blush and do a classic “drape” on my cheeks for colour and contour all at once. I love putting some on a fluffy brush and just going all around the eye for a super easy grunge look that makes blue eyes pop. Very unique product and a little bit goes a long way. I will definitely be trying some more colours in the future.",
    "time": "2021-03-20T19:35:17.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "sparkleandflex",
    "rating": 2,
    "recemonded": false,
    "title": null,
    "text": "didn't stick! either I'm using it wrong or product just isn't for me which really sucks because I was sooooo excited for it. it just seemed sticky. even with a tiny drop I couldn't get it to set and dry on my skin.\n even with primer, eyeshadow, eyeshadow even over top to try and dry it when it still was sticky... and setting spray.. Maybe I got a bad tube? I really wanted matte black but figured with eyeshadow and this it would still give me the same dark smokey look I was hoping for... it looked smokey sure.. but it was sticky all day :(\nif I figure out how to use it I without this issue, I will change my review. I've only tried it twice so far.",
    "time": "2021-03-20T11:55:34.000+00:00",
    "age": "over54",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "FowlMari",
    "rating": 4,
    "recemonded": true,
    "title": "love it!",
    "text": "Absolutely love it!!! The formula is very creamy enough to work with it before it dries. I wanted some colored eye liners that are long lasting and this works well for that!! I created a wing with it and it lasted all day.  No smudges or fading or smearing. I’m happy. I love this color as well. I’m definitely picking up more colors!",
    "time": "2021-03-20T05:06:54.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Kaymae1789",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "This is so good on oily eyelids! Gorgeous one and done color or layer a glitter or shimmer on top. Perfection! Wish she would come out with more colors.",
    "time": "2021-03-20T02:41:28.000+00:00",
    "age": "25to34",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "GG84",
    "rating": 1,
    "recemonded": false,
    "title": "Missed the Mark",
    "text": "I wanted to love this product. I read tons of reviews and visited DMB website before making my purchase, I was sure Colorfix was going to be the product for me based on the photos and rave reviews. I was looking for a clear shade to give a glossy look when I do a Smokey eye. I couldn’t get this to work without shifting my eye make up (tried powder/cream shadow with primers), it made an absolute nightmare of my mascara and just over all was not the product for me.",
    "time": "2021-03-20T02:18:33.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "IARO",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "Love these products. I have colorfix in rustic, carrot top and latte. Only need a tiny amount because the pigmentation is SO GOOD. A little goes a long way! I use all these colors for multi-purpose make up. Eyes, lips, cheeks. No caking and not sticky either. Really great product.",
    "time": "2021-03-20T02:04:12.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Poptart40",
    "rating": 5,
    "recemonded": true,
    "title": "Gorgeous all in one product!",
    "text": "I initially bought Exposed and Creme Brulee to try. I was blown away by the versatility and longevity of these pigments! A tiny drop goes a long way. Then I discovered Romance. I'm in love! The color is great on eyes, cheeks and lips. It lasts all day, even after I go walk my dog while sweating in 80 degree weather! I have since bought the Vision Cover Foundation/Concealer and the clear glaze to top the Romance lip look.. DMB is becoming my go to brand for one and done makeup!",
    "time": "2021-03-19T14:05:47.000+00:00",
    "age": "45to54",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "red71dee",
    "rating": 2,
    "recemonded": false,
    "title": "meh",
    "text": "Just gloss with glitter. Nothing great. I won’t buy again.",
    "time": "2021-03-19T13:07:48.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "ashleymermaid",
    "rating": 1,
    "recemonded": false,
    "title": "leaky",
    "text": "I opened the package and it was completely sticky. the whole thing had leaked. I'm so sad because I love Danessa and this just wasn't it.",
    "time": "2021-03-17T16:11:58.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "verge",
    "rating": 4,
    "recemonded": true,
    "title": "Long lasting eyeshadow",
    "text": "This is a nice formula.  It goes on creamy and dries to a powder.  Easy to apply. Lasts a long time without budging. Latte is a little more brown than pink to me.  I also have Valentine which is a very bright pink.",
    "time": "2021-03-17T14:57:59.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Emeraldeyes529",
    "rating": 5,
    "recemonded": true,
    "title": "Shade Venus looks similar to Alien",
    "text": "This looks gorgeous on the eyes.  I bought Venus & it is very much a duochrome or even multichrome with shifts from orange to deeper pink & in between.  It is so sparkly & reminds me of my Clionadh multichrome eyeshadows.  I love that there is enough time to work with it & sheer it out on the edges before it dries down.  I've tried going back over it with a 2nd coat for even more opacity & that looks great too.  This foiled shade is very very sparkly and textured, so if you are into that sort of thing - you will love it.  I also tried to sheer some out on my lips and that looked great with a clear gloss (from Tower28) over top of it.  Now, I did read some reviews saying that these bottles dry out - even with the cap bring on snug - and if that day comes I will truly be disappointed.  But so far this is a ☆☆☆☆☆ purchase.  I am looking at getting a matte 1 & glossy 1 to try those formulas too.",
    "time": "2021-03-16T18:52:27.000+00:00",
    "age": "35to44",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "tikotiko",
    "rating": 5,
    "recemonded": true,
    "title": "Exspose",
    "text": "I received this product today   nd oh my  love the color the formula  everything  about it    so soft and all u need is a drop and the coverage  is beautiful  soft    sexy    natural",
    "time": "2021-03-15T19:49:46.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "true"
  },
  {
    "name": "shaundra",
    "rating": 5,
    "recemonded": true,
    "title": "Awesome Versatile Product",
    "text": "The colorfix pigments are amazing! I use them on my lips and eyes. It's worth the price because of the versatility. You get to use this product multiple ways instead of buying blush, a lip product and/or eyeshadow separately. ..u just Need one product that does it all...U need this!",
    "time": "2021-03-15T17:09:00.000+00:00",
    "age": "35to44",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "winkle",
    "rating": 1,
    "recemonded": false,
    "title": "not crease proof if you have oily lids.",
    "text": "I have oily lids this product was not crease proof lasted about 3.5 hours then transfered to my upper lid. I thought this would be the one sadly... on to the next!",
    "time": "2021-03-14T16:10:45.000+00:00",
    "age": "35to44",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "julia412",
    "rating": 5,
    "recemonded": true,
    "title": "Goldmine",
    "text": "Each of the Colorfix pigments is fantastically longwear and multi-use. Goldmine is great on its own  used as a liner or as a shadow. It’s a beautiful neutral gold that looks much warmer in the tube than it does on the skin (see photos for reference). The shimmer and reflect in this particular finish never disappoints!",
    "time": "2021-03-14T15:30:56.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "ccruz718",
    "rating": 5,
    "recemonded": true,
    "title": "My Zoom Meeting Looks just went up 10 notches",
    "text": "I was excited to see a new makeup brand launch for a black woman owned business. I bought 2 color fix pigments but Alien took my breath away. Just a unique peachy orange color with gorgeous crystal glitter. Would look gorgeous anytime but I can see this complimenting a tan in the summer. Swatched on my hand (last color) but the picture doesn’t do it justice.",
    "time": "2021-03-14T06:07:23.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "jluney",
    "rating": 1,
    "recemonded": false,
    "title": "DRIES OUT AFTER 1 USE",
    "text": "These COMPLETELY dry out after 1 use. I even had a few I had never opened that also dried out. This is a HUGE issue and needs to be fixed. I love the color pay off but to only get one use out of a product is unacceptable",
    "time": "2021-03-13T17:41:01.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "kayflorida",
    "rating": 4,
    "recemonded": true,
    "title": "Titanium",
    "text": "Bought titanium and oil slick (which I reviewed separately).  Titanium goes on well, and a little goes a long way.  Color is gunmetal and on my light colored eyelids, it looks like it has a greenish cast to it.  It went on much thicker than oil slick, which I found runny.  And it's very sparkly, but in a good \"non chunky glitter\" way.  One thing...which is good but also not so good...is that it's very difficult to remove.  The only thing that removed it was my Lancome eye make remover, and even then it took a lot of scrubbing to get it off.  So, most likely, it will be on all day but you will need a good eye makeup remove to get it off.  I had no success with soap and water and Makeup Eraser towel.  In comparison, the oil slick color came right off very easily.",
    "time": "2021-03-13T14:07:27.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "kayflorida",
    "rating": 2,
    "recemonded": false,
    "title": "Oil Slick",
    "text": "I bought two shades, oil slick and titanium.  Oil slick seemed runny while titanium did not.  On the eyes, it was very dark and unforgiving; meaning I couldn't really sheer it out, so it looked too dark on my light colored skin.  Also, there are predominately red sparkles, but out of the tube they are large, sparse and not sparkly, like a Stila sparkle liquid eye shadow is (as in example).  I'm returning this color.  I'd only recommend if you are looking for a very dark black for your eyelids.",
    "time": "2021-03-13T13:59:51.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "figgy2008",
    "rating": 5,
    "recemonded": true,
    "title": "Outstanding product",
    "text": "I absolutely love this product. The clear I put over powder eyeshadow and it made it so pretty and it stayed without creasing. Used it as highlighter alone and over powder highlighter. This is one of the best makeup products I have ever bought. It only takes a drop of it to get the most beautiful effect that lasts, isn’t sticky and doesn’t pick up what’s underneath. Also, bought the cream brûlée color that is matte and it’s so versatile and gorgeous as well. I want all of these now. They are fun to use.",
    "time": "2021-03-13T00:44:40.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "CakeSnob",
    "rating": 1,
    "recemonded": false,
    "title": "I’m Torn...",
    "text": "I discovered DMB last year and was blown away with most of her line.  Love at first sight!  I splurged and bought almost every shade of Colorfix.  Clearly a $500 investment!!!\n\nEven purchased a special makeup acrylic holder to showcase them.  Tried a few and loved the dry down and full pigment of them.  Then...a month later I attempt to show a client how good they work and 6 were dried out...and I had never even opened it.  I sent (2) inquiries emails to DMB customer service and NEVER received a response. So disappointing. I KNOW others have experienced this drying out effect and IT NEEDS TO BE FIXED. What a waste of money.  No more Colorfix until something changes.  So freaking frustrating....",
    "time": "2021-03-12T23:13:22.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "civ2ru",
    "rating": 3,
    "recemonded": false,
    "title": "I didn’t care for it, please don’t hate me! :-)",
    "text": "To be fair, I can completely see why so many MUAs swear by this product! It is quite literally paint for their artist palettes. Once placed, it does not crease or budge, faithfully staying put until you’re ready to take it off. For everyday natural woke-up-like-this look though, I found it a little harsh and flat. There isn’t any softness, subtleness or dimension to it. Plus, it doesn’t play all that well with other eye color products. This is raw pigment, bold to the extreme – completely matte or insanely metallic or outrageously glossy – with bold shades to boot (nothing “nude”, understated or dreamy). So, if you’re going for that fierce single wash of color, or editorial of-the-moment glossy eye, get ready to pull out your arsenal of brushes, mix shades together and go for it – you will be in love. But for me, I’ll keep looking.",
    "time": "2021-03-12T21:30:07.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "bramsay",
    "rating": 5,
    "recemonded": true,
    "title": "Beautiful",
    "text": "They last all day, and show up true to color on any skin tone. They dry down fast though so you need to work quickly.",
    "time": "2021-03-12T17:20:36.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "LisaMarieDennis",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "Alien is the first colorfix i bought almost 1 year ago and it is still my favorite lid topper or all over eye look! I have almost half of DM colorfix collection now and I love them all!!! Super long wearing and doesn't crease on my oily eye lids. First photo is of alien on its own and second photo is a glossy eye using her Glaze formula.",
    "time": "2021-03-12T04:06:54.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "Bink1026",
    "rating": 5,
    "recemonded": true,
    "title": "Lovely. HUGE color payoff",
    "text": "Holy color payoff! A little goes a long way on this product ladies and gents! I have light with neutral undertone skin with blue eyes and brown hair. The creme brule shade is the perfect monochromatic look for eyes, cheeks and lips. It  is so good! I feel like it doesn't last *as* long on the cheeks for some reason but on the eyes and lips, they last quite a while. Not totally transfer proof but it'll stay there until you're ready to take it off. Would love to give the glazes a try",
    "time": "2021-03-12T02:08:44.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "AdriallRose",
    "rating": 4,
    "recemonded": true,
    "title": null,
    "text": "Review is for Nebula. Sephora won’t allow me to choose Nebula- \n\nHoly Crazy Glue hold. Unlike the regular matte shade I have- Exposed- this does not crease or move once put on BUT it does dry down super fast. I put some on the back of my hand to dab from but it turned solid in a matter of seconds. So I put it straight on my finger and applied. Less is more at first. \n\nWow! This is sparkly. I love throwing it over my matte shades for a really quick party eye. I’m terrible at eyeshadow so these products have been fantastic to get into that world while having 0 talent. The glitters are big and small so there are some craft glitter sizes thrown in there along with some small shimmers- so it’s got a lot of shine to offer. \n\nMy only thing- There is no fallout from this BUT if you accidentally get some glitter where you don’t want it you better believe it’s not going anywhere.",
    "time": "2021-03-11T17:06:06.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "dotinfla",
    "rating": 5,
    "recemonded": true,
    "title": "The BEST cream e/s on the planet",
    "text": "Looking for a waterproof, smooth, easy to blend one/done e/s???? You’ve FOUND it!!  Every shade is super smooth, the matte formula is opaque and the metallic finish does NOT contain ANY glitter, thank heavens.  Not only is Color Fix easy to apply, with ZERO creasing and doesn’t cling to dry areas, it also magically minimizes the texture on my “mature” lids.  Tried Exposed first, adored it so got Romance (pink metallic) which has a lovely sheen if blended a bit but if not, an almost foiled finish, that yes, looks great even on “mature” eyes. Ballerina is another awesome shade with a very unique finish (satin metallic) that’s more “pink” than Romance and great for a one/done look (as are all 3) and they STAY PUT.  They do dry down rapidly so apply/blend fast but can be layered even if the bottom layer is completely set.  I’ve searched a few years for the perfect cream e/s and this is IT (better than Tom Ford, seriously).  Will likely be great on cheeks/lips too.",
    "time": "2021-03-11T16:22:05.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "jglamm",
    "rating": 5,
    "recemonded": true,
    "title": "Dream Lids",
    "text": "Oil Slick is the eye gloss of my dreams. If you want a one and done, sexy, smudgy eye this is for you. Definitely don't recommend it for those who like precision lines and cut creases.  My lids are darkly pigmented so it just works. This, some kohl in the waterline and mascara .. BAM!  It is a gloss, so I can see where some may not like it on their lid, but I found it to be light and not annoying. I personally wouldn't want to use a primer under it.  It also worked beautiful with a pigment I have tapped on top, but it doesn't really need a boost. Definitely will be beautiful on a hot, summer night. I have not tried it yet on my lips or checks, but I will say definitely put a tiny, TINY dot on your hand or working palette before you go in. You don't need a lot, and can be build up a bit.",
    "time": "2021-03-10T14:20:25.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "emmeliza",
    "rating": 5,
    "recemonded": true,
    "title": "Amazing",
    "text": "Very bold and you only need a little. It’s so lovely, colour is amazing. Make sure you have some serious remover though because it’s challenging to take off",
    "time": "2021-03-10T08:36:49.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "aud723",
    "rating": 1,
    "recemonded": false,
    "title": null,
    "text": "This has amazing reviews so not sure why it didn’t work for me. When I tried applying alien over her matte shade exposed it took off the matte shade underneath. I tried it w my smallest finger and a small synthetic brush and it literally removes the layer underneath despite waiting for the matte layer to dry. It is also way too sparkly for me. It’s almost like clear w just some rose gold sparkles. Not happy with it at all. I don’t know how anybody gets this to work.",
    "time": "2021-03-09T15:08:50.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "melissameier99",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "I never write reviews but this might be my new favorite product.  Perfect for lips, eyes and cheeks, lasts all day.  Definitely buying more colors!",
    "time": "2021-03-09T13:28:39.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "kougar91",
    "rating": 5,
    "recemonded": true,
    "title": "Just buy it!",
    "text": "I bought Rocket and 2 others and OMG! Absolutely beautiful, stunning! They dry down beautifully, I honestly want to buy all of them. Support this brand, you will not be disappointed! There is nothing like this!",
    "time": "2021-03-09T02:31:48.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "helentiffanycee",
    "rating": 5,
    "recemonded": true,
    "title": "IM BLOWN AWAY",
    "text": "I didn’t expect it to be such a small tube, but it’s SO pigmented that each time I only need a tiny amount for my eyes cheeks AND lips so I know this will last me foreverrr. The shade “latte” is so universal and flattering, if you don’t know which shade to get I would recommend getting this first! It blends well with fingers which is a plus. It lasts 12+ hours even when I wear a mask. This is a phenomenal formulation.",
    "time": "2021-03-09T02:19:33.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Jetlouisey",
    "rating": 5,
    "recemonded": true,
    "title": "WOW!!!!",
    "text": "Dang this product is beautiful. As soon and I got product out of the bottle I was impressed! Easy to put on and blend and it’s just stunning on! This color could look nice on the skin too I think, but I’ve only worn it on my eyes so far. Seriously impressed ! I will probably buy more shades.",
    "time": "2021-03-07T19:31:13.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "HoneybabyEve",
    "rating": 5,
    "recemonded": true,
    "title": "I love my Colorfix. You can't go wrong.",
    "text": "I was soooo lucky to be introduced to Colorfix last year. I've started my collection. All you need a drop that get the color. They are so pigmented. Needless to say, I still have the ones I got last year. I can use as eye shadow, blush or lipstick.  If I want shine, then I always use the clear glaze on top of matte colorfix once it dries. It last all day. Thank goodness I love my Colorfix. I just purchased the new glazes from Sephora and they arrived ved yesterday.  Can't wait.",
    "time": "2021-03-06T01:57:38.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "Deirb",
    "rating": 3,
    "recemonded": false,
    "title": "Dries out QUICKLY",
    "text": "I really love these products.  They are beautiful and fun.  But many do not even last 6 months before completely drying out.  It's so frustrating especially when you want to collect a few colors at once.  I had to throw out 6 of them because I couldn't even get it out of the tube itself to even try to revive it with inglot.  They need to either tweak the formula or get a better packaging to give it more longevity.  As much as they are beautiful, I won't be buying anymore until they do changes because otherwise i'm just flushing my money down the drain.",
    "time": "2021-03-05T14:59:24.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "DollfaceDredie",
    "rating": 5,
    "recemonded": true,
    "title": "Sets like a dream!",
    "text": "The color fix is a MUST HAVE for any makeup artist, or anyone really. It does just what it says. It absolutely lifts any shade beautifully. I enjoy creating custom colors with this formula, and this pure white formula is just that. It layers beautifully on deep skin as well. Quick tip: be sure to work in layers for more opacity. Just like any paint, let your first layer set before applying another layer. But you will get very rich opacity even on your first layer. My favorite is creating a custom lilac shade using fruit punch, cobalt and adding a touch of lift. I use them on lips, cheeks, eyes and everything in between. I have over 15 shades and I intend to carry the whole collection! These set beautifully, you don't even have to apply powder on top, but eyeshadows also layer like a dream if you wish. In my opinion, lift is best used directly on the skin (no primer)! #dmbangels",
    "time": "2021-03-04T18:07:24.000+00:00",
    "age": "18to24",
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "true"
  },
  {
    "name": "Jay0319",
    "rating": 5,
    "recemonded": true,
    "title": "Amazing for MUA’s",
    "text": "I’m a professional makeup artist and have about 10 of these. BUT for my kit the ones I use are the primary yellow, primary blue, primary red, black, and the white one. So I can create any color I could possibly want from just these 5 shades. These are a MUST HAVE for my kit. I can use them as eyeshadow, eyeliner, lipstick, blush, etc. Anything! They make me feel so prepared for any job. You want a green lipstick? I can do that. Yellow eyeliner and purple brows? Easy. I just love these so much! Such a wonderful formula and easy to work with. I also got the clear glaze to use to create glossy lips or glossy eyes. Highly recommend these. If you are not used to using a liquid as an eyeshadow you’ll need a little practice but amazing products! And you get a lot for your money, a little goes a long way. So happy to see her brand at Sephora!",
    "time": "2021-03-04T07:20:52.000+00:00",
    "age": null,
    "sephora_staff": "true",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "OctoPrincess",
    "rating": 5,
    "recemonded": true,
    "title": "Can't Rave Enough",
    "text": "Been purchasing from Danessa Myricks beauty for a while now. This was my first product from the brand, as recommended per Hannah Louise Poston on YT. It truly is the sparkliest eyeshadow product I own. great for a one and done look or over a look you just want to bring some BAM to. Layers well over a full eyeshadow look (primer, mattes, glitter primer, metallic shadows, etc.). Extremely user friendly. I'm not much for gold shadow, love my cool tones (green, purple, blue) but the silver tone in this gold-ish shade works so well with cool tones, as well as the occasional warm tone look. The foils are where it's at with sparkles though. I have the matte black which I use as liner often, or a black 'base' for duo/multi chrome shadows. Also the shade 'Alien' is insane, also a foil. 'Cosmic' is also a black foil that's stunning but very dramatic and intense. Buy these as gifts for all my friends that wear makeup, even if they aren't into makeup like I am. Never ceases to blow minds.",
    "time": "2021-03-04T01:37:26.000+00:00",
    "age": "25to34",
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "Mellmars1185",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "This stuff is a dream! It goes on smooth and creamy. I spread product with my finger and buffed out with an eye buffing brush. It is definetly buildable and it is a nice light colour so a good base to build on. I have oily skin so the matte option is perfect for me. I bought in 'Clear' and 'Alien' and will report back on those. The fact that this is multi use for cheeks and lips is new and innovative with all of the shades.  The tiniest amount goes a long way",
    "time": "2021-03-03T18:03:28.000+00:00",
    "age": "35to44",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "sydneynoels",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "\"Rocket\" is such a beautiful shade. Its texture lies somewhere between a metallic foil and a glittery shadow. It lasts a very long time without budging!",
    "time": "2021-03-03T17:18:54.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "Lovetrenice",
    "rating": 5,
    "recemonded": true,
    "title": "I love these products!!",
    "text": "As a makeup artist. To find a product that is multi use is a DREAM! I love everything about the fact I can use it on my eyes, lips, and cheeks. I love that just this one tube packs a lot of product but doesn’t take up a lot of space, and I love that a little goes a long way. Definitely a must have!!",
    "time": "2021-03-03T17:13:41.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "Brittanykmua",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "A multi function makeup product that I absolutely love!!! This product is versatile for eyes, lips and face!! You cannot go wrong with this prodcut.",
    "time": "2021-03-02T21:21:11.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "true"
  },
  {
    "name": "AdriallRose",
    "rating": 4,
    "recemonded": true,
    "title": "Beautiful color but sinks into creases",
    "text": "Exposed is a lovely putty/earthy color that looks so good with brown eyes and pale skin. I throw on some mascara and my eyes look done. I could see putting a topper on directly in the center or using golds or amber shades with this. \n\nThis shade is a slightly warmer shade of Fenty’s Mocha match stix that I use for contouring. \n\nMy one complaint is that I have slightly hooded eyes and the product gets dissolved where my skin folds or pulls in the product. I have to pat it out usually anytime I look in the mirror so the wear time isn’t rock solid there. \n\nBut I will buy another shade because they are so fun!",
    "time": "2021-03-02T20:11:02.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "IslaCarys",
    "rating": 4,
    "recemonded": true,
    "title": null,
    "text": "I saw Katie Jane Hughes using Milky Way once and it caught my attention. Such a good foil that catches the light! It’s stunning.",
    "time": "2021-03-02T14:23:26.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "bramsay",
    "rating": 5,
    "recemonded": true,
    "title": "Chestnut, Nebula, Dessert Rose, Alien",
    "text": "These are amazing. The formula is super pigmented and true to color. They dry down really quickly so you need to move fast, but they last ALL DAY without fading or smudging. A little goes a long way, so you shouldn’t use too much at a time. It’s better to build up the color. Especially with the foils. I put too much on the “Alien” swatch and you can see they start to ball up a but if there’s too much at once without letting the layers dry down. I thought these would be hard to use but I was pleasantly surprised at how easy they were to blend and layer.",
    "time": "2021-03-01T22:38:31.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "MarieofMars",
    "rating": 5,
    "recemonded": true,
    "title": "Purchased with my own money",
    "text": "amazing for oily lids that crease a lot. I bought the Primary Yellow and Primary Red. The red is a true red however the yellow is more of a mustard which I prefer.",
    "time": "2021-03-01T21:31:06.000+00:00",
    "age": "over54",
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "teeonmakeup",
    "rating": 5,
    "recemonded": true,
    "title": "❤️ Colorfix",
    "text": "I love all of the colorfix colors. They are very versatile and can be used as eyeshadows, blush and lipstick. Whatever you need!",
    "time": "2021-03-01T12:48:41.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "k3ndr0aaa",
    "rating": 5,
    "recemonded": true,
    "title": "The best!",
    "text": "Omg I loved this product. Works so well with my deep skin tone for blush or a cute lip! Buying every color!",
    "time": "2021-03-01T08:04:40.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "Coco818",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "I'm obsessed with my Colorfix!!! The colors are everything and last day.",
    "time": "2021-03-01T00:03:42.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "Susieqx",
    "rating": 5,
    "recemonded": true,
    "title": "Here's the trick",
    "text": "Absolutely love these. This is the way I like to use them. I have blackout and lift and I mix them with my complexion products (concealer, foundation, bronzer etc) lighten or deepen a shade without changing the pigment color. I even use it on lipsticks or blush. It works amazing, try it for yourself. That way, if you have something that is the right tone, but you just want it a little darker or lighter, you have a simple fix. As an added bonus, colorfix is very long-lasting and will extend the wear of the base product. Happy mixing! :)",
    "time": "2021-02-28T03:16:00.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "beckyshah",
    "rating": 5,
    "recemonded": true,
    "title": "love!",
    "text": "I love Danessa Myricks colorfix! I have some of the metallic, foil, and glaze colors. They are stunning and they actually last on the eyes. You can use colorfix for anything. Want sparkly gold brows? Colorfix! I use them to make natural, glowy looks, but they can also create bold artistry. Get it! You will not be disappointed!",
    "time": "2021-02-27T14:06:49.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "gabbyfishermua",
    "rating": 5,
    "recemonded": true,
    "title": "Budge proof, versatile color!",
    "text": "Colorfix is a makeup artist's dream. If you want to create a bold opaque eye, vivid liner, or budge proof primer then you will LOVE this product. I use this on photo shoots and on myself daily and there is no product like it on the market.",
    "time": "2021-02-27T04:19:30.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "ladida22",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "The Foils are so stunning. They start off a little sheer at first, but they build up nicely once you let her first layer dry. I love the way it looks layered on top of the mattes.",
    "time": "2021-02-27T01:45:48.000+00:00",
    "age": null,
    "sephora_staff": "true",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "ladida22",
    "rating": 5,
    "recemonded": true,
    "title": "PIGMENT!",
    "text": "if you’re looking for pigments you will not be disappointed. The Mattes have a lovely soft velvet finish to them. \nWatch out,they do dry quite fast! so pls apply one eye at a time.",
    "time": "2021-02-27T01:42:41.000+00:00",
    "age": null,
    "sephora_staff": "true",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "ruthless",
    "rating": 3,
    "recemonded": true,
    "title": "Fantastic product terrible packaging",
    "text": "I own this and many other shades , the tubes dry out within three months and you need 244 fluid to rescue them. I had one tube arrive already dried out! This isn’t a new issue either.",
    "time": "2021-02-27T01:08:37.000+00:00",
    "age": "25to34",
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "stephlifebeauty",
    "rating": 4,
    "recemonded": true,
    "title": "Beautiful finishes but they dry out quickly",
    "text": "I absolutely love the color fix pigments. I have about 10 shades across the matte, metallic, foil, and glitter shades, and the finish of all them is really beautiful. They are super blendable and pigmented, and I have no issues with these lasting all day (even without a primer). I don't think you can go wrong with any of the shades! One downside is that one of mine (Celebration) is starting to dry out a little bit after 6 months of using it, and I have heard of this happening to other people. I would recommend these if you know you are going to use them often otherwise they will dry out fairly quickly compared to other cream eyeshadows.",
    "time": "2021-02-26T19:41:26.000+00:00",
    "age": "18to24",
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "KJMbeauty",
    "rating": 5,
    "recemonded": true,
    "title": "Beautiful Products",
    "text": "Beautiful product!! Amazing pigment and long wearing.",
    "time": "2021-02-26T13:44:50.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "True",
    "free_product": "false"
  },
  {
    "name": "NerissaAP",
    "rating": 5,
    "recemonded": true,
    "title": "Colorfix changed my perspective.",
    "text": "Colorfix had a learning curve for me personally but let me tell you. It’s worth the experimenting!! I love that it’s waterproof and stays put. But it’s not only the formula that I love, I love the fact that it’s the product that really allowed me to experiment and try new things. You can mix colors to get the color that YOU want- I hardly use just one Colorfix without mixing it and it’s always so satisfying. Colorfix has definitely helped me broaden my perspective and use of product. \nAlso, if you love glitter, you’ve got to try the foils/metallics. It’s liquid that dries down and stays put. NO FALLOUT. Brilliant. One of my absolute faves is Nebula. A gorgeous gold glitter. Can’t wait to get more!",
    "time": "2021-02-26T05:42:56.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "BeautyandQueers",
    "rating": 5,
    "recemonded": true,
    "title": "Versatile and easy to work",
    "text": "I cant believe we will have now on Sephora! I love all Colorfix they are amazing to work, so many options and versatility!",
    "time": "2021-02-26T01:00:19.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "marianadae",
    "rating": 5,
    "recemonded": true,
    "title": "The go-to product",
    "text": "This product is HEAVENLY! A little bit does the trick. My “go-to” is CELEBRATION. On fair skin it looks so great on the eye and super easy to apply. And I can rest assure that it will last me all day long. You can pretty much get ready to purchase every shade. I did!",
    "time": "2021-02-25T21:30:51.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "andrewdahling",
    "rating": 5,
    "recemonded": true,
    "title": "A MUST!!!!",
    "text": "This product is everything to me! I am a pro mua so yeah versatility the blend-ability and the crazzyyu staying power are why I love this product so much! For the peeps who just do their own makeup, don’t be intimidated by it, this can be EASILY used as eyeshadow blush or lips, or even brow tint if ya nasty! You will instantly fall in love I swear, you have to force this stuff to come off otherwise it’s there sitting pretty all day! It’s a must, I’ve been using it forever and there it TRULY nothing like this on the market! Throw it in your makeup bag travel and use a couple shades for a whole lewk, everyone will be wondering what you have on!!",
    "time": "2021-02-25T21:18:03.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "Tutilicious",
    "rating": 5,
    "recemonded": true,
    "title": "Perfect contour shade for fair skin tones",
    "text": "I have a fair skin tone and I use this shade to contour my face, it's spotless!!",
    "time": "2021-02-25T16:34:55.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "danielleex0o",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "This product is a MUST have for a makeup artist and really any beauty enthusiast. This product is designed to once it’s really dry you can go over the color on the bottom. So that makes it ideal for working on a shoot or if you mess up your makeup and want to go over it. The color payoff is amazing. It’s so quick to use when your in a rush! I have every color!  In the pictures I’m posting I went from a plum look to the yellow orange look using these products in minutes!!",
    "time": "2021-02-25T14:33:22.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "Scoobydoo1031",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "I have used a lot of different shades of this product and they are amazing! Lightweight, beautiful finish, and long lasting. The amount of different shades is amazing and always ready for any outfit or season!!!! Love love love",
    "time": "2021-02-24T23:30:11.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "Nakiyajenkins",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "Colorfix is super easy to use and a little truly goes a long way. It’s super nice to finally find a shade that matches my skin and I can wear my shade of nude",
    "time": "2021-02-24T22:43:03.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "true"
  },
  {
    "name": "anniefab",
    "rating": 5,
    "recemonded": true,
    "title": "Stunning gold !",
    "text": "Love this beautiful color! It Adds such a beautiful shimmer to any look! All the colorfux fools are stunning!",
    "time": "2021-02-24T22:39:59.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "anniefab",
    "rating": 5,
    "recemonded": true,
    "title": "Versatile color!!!",
    "text": "This is one of my favorite colors were lip I and chic it is so versatile! The formula is amazing!!",
    "time": "2021-02-24T22:19:36.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "scottielynx",
    "rating": 5,
    "recemonded": true,
    "title": "Hands down my fave makeup product of the moment",
    "text": "I use Colorfix for just about everything! As eyeshadow, lipstick, brow color, contour, blush, you name it! I've been obsessed with using liquid and cream shadows over the last year. Not only because it's more sanitary for a makeup artist (i can just squeeze a little out onto a metal palette and never have to touch it again vs having to dip back into a powder eyesahdow), but also because I can mix and customize any color i want! It's a painter's dream! I do have to say, there is a small learning curve. Like I said, it's like painting if you are an artist. You have to work quickly and use very little product and slowly layer it for intensity. And the best thing? I never have to worry about cleaning up fallout!",
    "time": "2021-02-24T19:54:17.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "Ronytaggar",
    "rating": 5,
    "recemonded": true,
    "title": "Easy to use, Great color for anything",
    "text": "i don't use allot of makeup, but this product is so easy to use, i just love it!!",
    "time": "2021-02-24T19:09:49.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "hausofponce",
    "rating": 5,
    "recemonded": true,
    "title": "Game changer",
    "text": "Let me start by just saying there is nothing like this product on the market the versatility and longevity of this product It’s like no other this product could be used On your eyes your cheeks your lips and these is a big game changer because no matter where you place it always look flawless It comes in many different textures to create a different finish but once the product sets its on all day but what makes it even more special if you have enough play time to get a flawless blend this product it’s a game changer for the beauty industry whether you are a every day makeup person or a pro on the go",
    "time": "2021-02-24T19:05:49.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "50Matty",
    "rating": 5,
    "recemonded": true,
    "title": "Awesome Product",
    "text": "I was nervous at first but was amazed on how easy it was to use. I only need a little bit on my hand.",
    "time": "2021-02-24T17:31:02.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "ChaChaPimPim",
    "rating": 5,
    "recemonded": true,
    "title": "Been using ColorFix - It is a must have!",
    "text": "Nice to see ColorFix is here. I am a user!!! I love the Color \"Magnetic\" for my eyes.  All you need is a little dot, a little goes a really long way--It does not crease.   For my pinky glow, I use \"Venus\" on my cheek and lips and add a drop of \"Glaze\" for the extra shine.",
    "time": "2021-02-24T17:23:42.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "true"
  },
  {
    "name": null,
    "rating": 5,
    "recemonded": true,
    "title": "Long wearing high shine gloss!",
    "text": "Gloss with refects! I use this on the lips with a bold eye or on the lids to amplify the shades and contrast! Amazing formula , lasts a long time without a sticky feeling unlike other glosses I have tried in the past. I highly recommend the clear glaze too.",
    "time": "2021-02-24T17:22:31.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": null,
    "rating": 5,
    "recemonded": true,
    "title": "Unique beautiful shade",
    "text": "By far one of my favourite colorfix shades! So striking in colour so can be really amplified or make for the perfect glam.",
    "time": "2021-02-24T17:17:44.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": null,
    "rating": 5,
    "recemonded": true,
    "title": "Beautiful",
    "text": "Amazing universal product! Ballerina is a beautiful metallic pink for the eyes lips and face!",
    "time": "2021-02-24T17:13:58.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "chelseamariemua",
    "rating": 5,
    "recemonded": true,
    "title": "Theeeee best product ever !!!!",
    "text": "As a makeup artist these products are my holy Grail !!! These multi-use colofix are perfect for eyeshadow, brows, lips , cheeks , literally everything !!! They are so light wight and make my job so much easier not to mention the pigment and longevity is out of this world !!!! As an everyday makeup wearer these products make my daily routine so much quicker to get ready in the morning you need very tiny drop because a little goes a very long way !.",
    "time": "2021-02-24T16:53:55.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "Tutilicious",
    "rating": 5,
    "recemonded": true,
    "title": "GORGEOUS!",
    "text": "I adore this product, it literally has the most beautiful metallic chromatic shift I've ever seen. I love putting it on top of so many eyeshadow colors! It's a must have",
    "time": "2021-02-24T16:51:45.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "andramaekup",
    "rating": 5,
    "recemonded": true,
    "title": "Obsessed with Color Fix!!",
    "text": "Obsessed with Color Fix!! A staple in my pro makeup kit, I highly recommend this product. Color fix can do EVERYTHING. It’s my favorite liner, lipstick, blush and eyeshadow all in one. Can’t go wrong with a multipurpose, highly pigmented, long wearing product. Trust me when I say you will love it!!",
    "time": "2021-02-24T16:34:21.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "SatyaL",
    "rating": 5,
    "recemonded": true,
    "title": "Favorite product!",
    "text": "As a pro Makeup Artist of 20+ years, Danessa Myricks Colorfix is one of the most innovative products I've ever seen. It's pure pigment in a cream for eyes, cheeks, lips, face that is waterproof, long wearing, blends easily and it's simply magical! It comes in many colors, but I usually custom create the colors I want. I also use it as a base to intensify powder products. One of the coolest things is the Colorfix Glaze, which is a glossy product you can layer on top of other Colorfix or powder shadows that does not crease. So, you can achieve that wet editorial eye or glossy lip that stays in place. Clear Glaze is a must have!",
    "time": "2021-02-23T22:37:37.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "FernandaaC",
    "rating": 5,
    "recemonded": true,
    "title": "Colorfix is revolutionary",
    "text": "I absolutely love Colorfix! It literally changed my life and the amount of time I spent doing my makeup because this product can be used on your entire face as your lipstick,your blush, contour eyeshadow...",
    "time": "2021-02-23T21:23:47.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "allanface",
    "rating": 5,
    "recemonded": true,
    "title": "OBSESSED!!!",
    "text": "I am addicted to Danessa Myricks products but especially the cream pigments!!!  I love to mix them to create my own colors!  They are so beautiful on with different finishes and textures. It’s my go to for red carpet looks and editorials!  I’m so excited it’s available at Sephora!!!",
    "time": "2021-02-23T19:42:04.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "true"
  },
  {
    "name": "EmilyRoth",
    "rating": 1,
    "recemonded": false,
    "title": "Save Your Money & Do Not Buy!",
    "text": "Chalky, dry, and breaks apart. I have purchased this product before and would not recommend. I am surprised by the number of five star reviews already on this product to be honest, because I know that a lot of other people share my sentiment.",
    "time": "2021-02-23T14:18:58.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "DianaEssence",
    "rating": 4,
    "recemonded": true,
    "title": "The best orange ever!!! Color of happiness!!!",
    "text": "This is one of my most favourite colorfix colors.\nI think this is an amazing orange, works perfectly on eyes, on lips and cheeks.\nThe product is waterproof, 24 hours wear and works well with other products!!\nOne of my favourite ways to use it, is to apply in waterline! It looks magical!!!\nFinally, you will need just one drop to create a whole eye look. This is very pigmented!!",
    "time": "2021-02-23T06:04:04.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "Marvelann",
    "rating": 5,
    "recemonded": true,
    "title": "The best product on the market",
    "text": "The colorfix formula is truly like nothing else. I absolutely love every color I've ever bought and how customizable these all are.",
    "time": "2021-02-22T20:43:49.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "DianaEssence",
    "rating": 5,
    "recemonded": true,
    "title": "The best liner ever!!!!",
    "text": "OMG!!! So, first of all, this product is waterproof and 24 hours wear!!!  It has a creamy consistency and very blendable. \nSecond, I need to add, that you can use this as an eyeliner, you will forget about all other eyeliners in the market!!!\nFinally, you can apply this product and apply the colorfix in shade Clear or any other Glaze on the top of it and it will not move!!! It will stay there! This product is a life changer!!! In one word, THIS IS THE BEST!!!!",
    "time": "2021-02-22T05:43:11.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "abigalesonline",
    "rating": 5,
    "recemonded": true,
    "title": "MAJOR MUST-HAVE",
    "text": "Colorfix is the hero product that I always wanted, but could never find, until now. Colorfix is a perfect mix betweeen an eyeshadow and a liquid liner to delivery a high quality, long lasting, opaque color experience. Anyone from beginners to experienced professionals will be blown away by this formula!\n\nMy top Colorfix picks: Primary Yellow, Blackout, Lift, Primary Blue, Beaches, Goldmine, and Clear Glaze.",
    "time": "2021-02-22T02:20:42.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "danielleex0o",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "STAPLE COLOR! This is a must have. I'm a bridal makeup artist and I use this color on every single bride. Eyes, Cheeks, Lips. It doesn't budge! One of my favorite products!",
    "time": "2021-02-22T01:48:56.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "eunicekristen",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "I love this product so much. It’s so multipurpose, I use it for blush , eyes and lips! A little goes such a long way. I must have for sure",
    "time": "2021-02-21T22:37:39.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "JasmyneElise",
    "rating": 5,
    "recemonded": true,
    "title": "YES Venus!!!",
    "text": "Colorfix is amazing...PERIOD!\nNot only is it waterproof and doesn't move throughout the day, but the color Venus is the perfect color for my everyday pinky look. I can use it on my eyes and cheeks and be on my way!",
    "time": "2021-02-21T18:37:41.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "gkarpinmua",
    "rating": 5,
    "recemonded": true,
    "title": "Colorfix is magic in a tube!",
    "text": "An absolute must have for every beauty lover and pro makeup artist! Colorfix changed the game. Very highly pigmented, waterproof, and long-wearing!  I use this product for every single makeup I create.  Magic in a tube!",
    "time": "2021-02-21T08:28:42.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "Gottaglow2",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "Such a versatile product! An absolute MUST in every makeup kit!",
    "time": "2021-02-21T06:39:28.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "1000attempts",
    "rating": 5,
    "recemonded": true,
    "title": "Been loving Ms. Myricks' products",
    "text": "I purchased Latte and Exposed (matte), Glacier (metallic) and the Clear Glaze this past Christmas.\nThe mattes are extremely pigmented and I add just a small dot on my hand then apply with a firm (flat shader for example) brush, one eye at a time. I blow out the edges with a fluffy eye brush and it's a one and done. \nIt dries quickly and stays put!\nI've used these on my lips but have not been brave enough to use on cheeks, you have to work quickly with this product.\nBut it does what it says!\nThe clear glaze is best for editorial purposes and will crease the product underneath. If you let (for example) the matte shade dry and then apply the clear glaze over top, patting on with a more densely packed brush (I use a flat shader brush), it will last longer.\nHappy to have these products available at Sephora soon. I'll be buying more.\nI also have her Vision Flush in Tiara and Illuminating Veil in Serenity.",
    "time": "2021-02-20T19:39:31.000+00:00",
    "age": "35to44",
    "sephora_staff": "false",
    "verified_purchaser": "False",
    "free_product": "false"
  },
  {
    "name": "LEJones",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "Part of what I call my Danessa Myricks summer trio. I’m super busy so I like a quick and easy face while at the  same time looking chic and all made up on the run. I use this for my eyes, lips and just a little on the cheeks along with her illuminating veil highlighter and a brighter highlighter for my t-zone  and tip of my nose. Ladies!!!! When I tell you, INSTANT FACE !!! Super easy.",
    "time": "2021-02-20T06:10:55.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "nicolebeauty",
    "rating": 5,
    "recemonded": true,
    "title": "H O L Y  G R A I L",
    "text": "As a pro makeup artist, I am constantly looking for new products to add to my freelance kit. I recently tried these out, and I have used them every single day since. I have about 20 shades, and I can say with full certainty that if you are someone who is looking for multipurpose products that pack a punch, these are them. You can use the Colorfix on the eyes, cheeks, lips, however you’d like. They dry quick so you definitely need to work fast, but honestly, I cannot recommend them enough.",
    "time": "2021-02-19T23:38:25.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  },
  {
    "name": "LDMUA",
    "rating": 5,
    "recemonded": true,
    "title": null,
    "text": "Exposed is amazing on the lips and eyes. Cool toned beige that isn’t too grey or too yellow is so hard to find. This is a staple in my regimen. I love it as an eyeshadow base. It’s also a great contour on fair to medium skin. Use sparingly! A little goes such a long way.",
    "time": "2021-02-19T23:34:55.000+00:00",
    "age": null,
    "sephora_staff": "false",
    "verified_purchaser": false,
    "free_product": "false"
  }
]